*** crates/session/src/goal.rs:153:9: replace Visibility::is_background -> bool with true

*** mutation diff:
--- crates/session/src/goal.rs
+++ replace Visibility::is_background -> bool with true
@@ -145,17 +145,17 @@
     #[default]
     Foreground,
     /// A cron, a webhook, or a dispatched subagent started it. Nobody is watching.
     Background,
 }
 
 impl Visibility {
     pub fn is_background(self) -> bool {
-        matches!(self, Self::Background)
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Lifecycle of one goal session.
 #[derive(Debug, Clone, Copy, PartialEq, Eq, Serialize, Deserialize)]
 #[serde(rename_all = "snake_case")]
 pub enum SessionStatus {
     Pending,

*** result: Success
