*** crates/session/src/store.rs:385:5: replace sanitize_id -> String with String::new()

*** mutation diff:
--- crates/session/src/store.rs
+++ replace sanitize_id -> String with String::new()
@@ -377,25 +377,17 @@
         // This double does not persist turns — the production store does, as message-DAG nodes.
         turns: Vec::new(),
         bus,
     })
 }
 
 /// Make a session id safe as a filename (ULIDs already are; a client-supplied id might not be).
 fn sanitize_id(id: &str) -> String {
-    id.chars()
-        .map(|c| {
-            if c.is_ascii_alphanumeric() || c == '-' || c == '_' {
-                c
-            } else {
-                '_'
-            }
-        })
-        .collect()
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// The kernel's view of this store (S5′). Delegates to the inherent methods above — keeping those
 /// public means the concrete store stays directly usable (tests, tools) while the hub talks only to
 /// the trait, so a converged `Session` store can take its place without the hub noticing.
 #[async_trait::async_trait]
 impl crate::record_store::SessionRecordStore for GoalSessionStore {
     async fn insert(&self, record: GoalSessionRecord) {

---- store::tests::awaiting_session_is_parked_on_rehydrate_not_failed stdout ----

thread 'store::tests::awaiting_session_is_parked_on_rehydrate_not_failed' (15904) panicked at crates\session\src\store.rs:526:44:
called `Option::unwrap()` on a `None` value

---- store::tests::mid_execution_session_is_coerced_to_failed_on_rehydrate stdout ----

thread 'store::tests::mid_execution_session_is_coerced_to_failed_on_rehydrate' (20052) panicked at crates\session\src\store.rs:556:45:
called `Option::unwrap()` on a `None` value

---- store::tests::durable_store_rehydrates_a_finished_session stdout ----

thread 'store::tests::durable_store_rehydrates_a_finished_session' (12160) panicked at crates\session\src\store.rs:491:44:
session should rehydrate

failures:
    store::tests::awaiting_session_is_parked_on_rehydrate_not_failed
    store::tests::durable_store_rehydrates_a_finished_session
    store::tests::mid_execution_session_is_coerced_to_failed_on_rehydrate

test result: FAILED. 13 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
