*** crates/session/src/goal.rs:183:9: replace SessionStatus::is_terminal -> bool with true

*** mutation diff:
--- crates/session/src/goal.rs
+++ replace SessionStatus::is_terminal -> bool with true
@@ -175,20 +175,17 @@
     Succeeded,
     Failed,
     Cancelled,
     BudgetExhausted,
 }
 
 impl SessionStatus {
     pub fn is_terminal(self) -> bool {
-        matches!(
-            self,
-            Self::Succeeded | Self::Failed | Self::Cancelled | Self::BudgetExhausted
-        )
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// How the session ended (surface-friendly).
 #[derive(Debug, Clone, PartialEq, Eq, Serialize, Deserialize)]
 #[serde(rename_all = "snake_case")]
 pub enum TerminalKind {
     Succeeded,

---- store::tests::mid_execution_session_is_coerced_to_failed_on_rehydrate stdout ----

thread 'store::tests::mid_execution_session_is_coerced_to_failed_on_rehydrate' (24284) panicked at crates\session\src\store.rs:565:9:
assertion `left == right` failed
  left: Running
 right: Failed

---- store::tests::awaiting_session_is_parked_on_rehydrate_not_failed stdout ----

thread 'store::tests::awaiting_session_is_parked_on_rehydrate_not_failed' (18748) panicked at crates\session\src\store.rs:535:9:
assertion `left == right` failed
  left: Running
 right: Parked

---- life_demo::tests::send_input_to_finished_session_errors stdout ----

thread 'life_demo::tests::send_input_to_finished_session_errors' (14300) panicked at crates\session\src\life_demo.rs:507:57:
called `Result::unwrap_err()` on an `Ok` value: ()

failures:
    life_demo::tests::life_domain_session_succeeds_without_coding_pack
    life_demo::tests::send_input_to_finished_session_errors
    store::tests::awaiting_session_is_parked_on_rehydrate_not_failed
    store::tests::mid_execution_session_is_coerced_to_failed_on_rehydrate

test result: FAILED. 12 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
