*** crates/session/src/goal.rs:183:9: replace SessionStatus::is_terminal -> bool with false

*** mutation diff:
--- crates/session/src/goal.rs
+++ replace SessionStatus::is_terminal -> bool with false
@@ -175,20 +175,17 @@
     Succeeded,
     Failed,
     Cancelled,
     BudgetExhausted,
 }
 
 impl SessionStatus {
     pub fn is_terminal(self) -> bool {
-        matches!(
-            self,
-            Self::Succeeded | Self::Failed | Self::Cancelled | Self::BudgetExhausted
-        )
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// How the session ended (surface-friendly).
 #[derive(Debug, Clone, PartialEq, Eq, Serialize, Deserialize)]
 #[serde(rename_all = "snake_case")]
 pub enum TerminalKind {
     Succeeded,

---- store::tests::durable_store_rehydrates_a_finished_session stdout ----

thread 'store::tests::durable_store_rehydrates_a_finished_session' (14292) panicked at crates\session\src\store.rs:500:9:
assertion `left == right` failed
  left: Failed
 right: Succeeded

---- life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript stdout ----

thread 'life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript' (20968) panicked at crates\session\src\life_demo.rs:380:9:
session parked-2 did not finish

---- life_demo::tests::send_input_to_finished_session_errors stdout ----

thread 'life_demo::tests::send_input_to_finished_session_errors' (13108) panicked at crates\session\src\life_demo.rs:380:9:
session 01KXGDP7N8F9VYM0266C1D2RZR did not finish

failures:
    life_demo::tests::a_grant_is_never_widened_by_sending_input
    life_demo::tests::a_session_that_may_ask_but_not_write_is_refused_at_the_write
    life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript
    life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer
    life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted
    life_demo::tests::life_domain_session_succeeds_without_coding_pack
    life_demo::tests::send_input_to_finished_session_errors
    store::tests::durable_store_rehydrates_a_finished_session

test result: FAILED. 8 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.57s

*** result: Failure(101)
