*** crates/session/src/goal.rs:255:25: delete ! in GoalSessionRecord::with_grant

*** mutation diff:
--- crates/session/src/goal.rs
+++ delete ! in GoalSessionRecord::with_grant
@@ -247,17 +247,17 @@
     pub fn new(goal: GoalSpec) -> Self {
         Self::with_grant(goal, SessionGrant::default())
     }
 
     pub fn with_grant(goal: GoalSpec, grant: SessionGrant) -> Self {
         let id = goal
             .id
             .clone()
-            .filter(|s| !s.trim().is_empty())
+            .filter(|s|  /* ~ changed by cargo-mutants ~ */s.trim().is_empty())
             .unwrap_or_else(|| Ulid::new().to_string());
         Self {
             id,
             goal,
             grant,
             visibility: Visibility::Foreground,
             status: SessionStatus::Pending,
             created_at: Utc::now(),

---- life_demo::tests::a_parked_session_is_not_told_it_finished stdout ----

thread 'life_demo::tests::a_parked_session_is_not_told_it_finished' (5592) panicked at crates\session\src\life_demo.rs:754:9:
a parked session must report Parked, not Terminal: Unknown

---- life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript stdout ----

thread 'life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript' (8272) panicked at crates\session\src\life_demo.rs:852:14:
a resumable parked session must accept its answer: Unknown

---- store::tests::in_memory_store_persists_nothing stdout ----

thread 'store::tests::in_memory_store_persists_nothing' (14880) panicked at crates\session\src\store.rs:588:45:
called `Option::unwrap()` on a `None` value

failures:
    life_demo::tests::a_parked_session_is_not_told_it_finished
    life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript
    store::tests::awaiting_session_is_parked_on_rehydrate_not_failed
    store::tests::durable_store_rehydrates_a_finished_session
    store::tests::in_memory_store_persists_nothing
    store::tests::mid_execution_session_is_coerced_to_failed_on_rehydrate

test result: FAILED. 10 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
