*** crates/session/src/store.rs:387:54: replace || with && in sanitize_id

*** mutation diff:
--- crates/session/src/store.rs
+++ replace || with && in sanitize_id
@@ -379,17 +379,17 @@
         bus,
     })
 }
 
 /// Make a session id safe as a filename (ULIDs already are; a client-supplied id might not be).
 fn sanitize_id(id: &str) -> String {
     id.chars()
         .map(|c| {
-            if c.is_ascii_alphanumeric() || c == '-' || c == '_' {
+            if c.is_ascii_alphanumeric() || c == '-' && /* ~ changed by cargo-mutants ~ */ c == '_' {
                 c
             } else {
                 '_'
             }
         })
         .collect()
 }

*** result: Success
