*** crates/session/src/goal.rs:27:9: replace DomainHint::as_str -> &str with "xyzzy"

*** mutation diff:
--- crates/session/src/goal.rs
+++ replace DomainHint::as_str -> &str with "xyzzy"
@@ -19,21 +19,17 @@
     Coding,
     Life,
     /// Explicit pack name for future packs.
     Custom(String),
 }
 
 impl DomainHint {
     pub fn as_str(&self) -> &str {
-        match self {
-            Self::Coding => "coding",
-            Self::Life => "life",
-            Self::Custom(s) => s.as_str(),
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl From<&str> for DomainHint {
     fn from(s: &str) -> Self {
         match s {
             "coding" => Self::Coding,
             "life" => Self::Life,

---- life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted stdout ----

thread 'life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted' (17904) panicked at crates\session\src\life_demo.rs:534:14:
called `Result::unwrap()` on an `Err` value: "no domain pack registered for 'xyzzy' (have: [\"life\"])"

---- life_demo::tests::life_domain_session_succeeds_without_coding_pack stdout ----

thread 'life_demo::tests::life_domain_session_succeeds_without_coding_pack' (17060) panicked at crates\session\src\life_demo.rs:676:14:
called `Result::unwrap()` on an `Err` value: "no domain pack registered for 'xyzzy' (have: [\"life\"])"

---- life_demo::tests::a_session_that_may_ask_but_not_write_is_refused_at_the_write stdout ----

thread 'life_demo::tests::a_session_that_may_ask_but_not_write_is_refused_at_the_write' (13896) panicked at crates\session\src\life_demo.rs:574:14:
called `Result::unwrap()` on an `Err` value: "no domain pack registered for 'xyzzy' (have: [\"life\"])"

failures:
    life_demo::tests::a_grant_is_never_widened_by_sending_input
    life_demo::tests::a_session_that_may_ask_but_not_write_is_refused_at_the_write
    life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted
    life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript
    life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer
    life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted
    life_demo::tests::life_domain_session_succeeds_without_coding_pack
    life_demo::tests::send_input_to_finished_session_errors

test result: FAILED. 8 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
