*** crates/session/src/goal.rs:307:9: replace SessionGrant::grants_ask_human -> bool with true

*** mutation diff:
--- crates/session/src/goal.rs
+++ replace SessionGrant::grants_ask_human -> bool with true
@@ -299,17 +299,17 @@
     #[serde(default, skip_serializing_if = "serde_json::Value::is_null")]
     pub overrides: serde_json::Value,
 }
 
 impl SessionGrant {
     /// Whether this session may interrupt a human for guidance — the check the hub makes before it
     /// wires up an input channel at all.
     pub fn grants_ask_human(&self) -> bool {
-        self.capabilities.grants_ask_human()
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]

---- life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted stdout ----

thread 'life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted' (23592) panicked at crates\session\src\life_demo.rs:536:60:
called `Result::unwrap_err()` on an `Ok` value: ()

failures:
    life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
