*** crates/session/src/goal.rs:307:9: replace SessionGrant::grants_ask_human -> bool with false

*** mutation diff:
--- crates/session/src/goal.rs
+++ replace SessionGrant::grants_ask_human -> bool with false
@@ -299,17 +299,17 @@
     #[serde(default, skip_serializing_if = "serde_json::Value::is_null")]
     pub overrides: serde_json::Value,
 }
 
 impl SessionGrant {
     /// Whether this session may interrupt a human for guidance — the check the hub makes before it
     /// wires up an input channel at all.
     pub fn grants_ask_human(&self) -> bool {
-        self.capabilities.grants_ask_human()
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]

---- life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript stdout ----

thread 'life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript' (21964) panicked at crates\session\src\life_demo.rs:852:14:
a resumable parked session must accept its answer: NotPermitted

---- life_demo::tests::a_parked_session_is_not_told_it_finished stdout ----

thread 'life_demo::tests::a_parked_session_is_not_told_it_finished' (21644) panicked at crates\session\src\life_demo.rs:754:9:
a parked session must report Parked, not Terminal: NotPermitted

---- life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted stdout ----

thread 'life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted' (23504) panicked at crates\session\src\life_demo.rs:471:9:
assertion `left == right` failed
  left: Cancelled
 right: BudgetExhausted

failures:
    life_demo::tests::a_grant_is_never_widened_by_sending_input
    life_demo::tests::a_parked_session_is_not_told_it_finished
    life_demo::tests::a_session_that_may_ask_but_not_write_is_refused_at_the_write
    life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript
    life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer
    life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted
    life_demo::tests::send_input_to_finished_session_errors

test result: FAILED. 9 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.56s

*** result: Failure(101)
