*** crates/session/src/goal.rs:53:9: replace <impl Deserialize<'de> for DomainHint>::deserialize -> Result<Self, D::Error> with Ok(Default::default())

*** mutation diff:
--- crates/session/src/goal.rs
+++ replace <impl Deserialize<'de> for DomainHint>::deserialize -> Result<Self, D::Error> with Ok(Default::default())
@@ -45,17 +45,17 @@
 impl Serialize for DomainHint {
     fn serialize<S: serde::Serializer>(&self, s: S) -> Result<S::Ok, S::Error> {
         s.serialize_str(self.as_str())
     }
 }
 
 impl<'de> Deserialize<'de> for DomainHint {
     fn deserialize<D: serde::Deserializer<'de>>(d: D) -> Result<Self, D::Error> {
-        Ok(Self::from(String::deserialize(d)?.as_str()))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Where a session came from (session-focus D2/S4). Separate-but-linked: the session's transcript
 /// stays its own, but on terminal its summary can be folded back into `conversation_id`, and
 /// `correlation_id` stitches it to the dispatch journal — the same linkage `delegate` already uses.
 /// `None` for sessions a human started directly (`POST /api/goals`, `/sessions` switcher).
 ///

*** result: Success
