*** crates/session/src/goal.rs:81:9: replace SessionOrigin::from_conversation -> Self with Default::default()

*** mutation diff:
--- crates/session/src/goal.rs
+++ replace SessionOrigin::from_conversation -> Self with Default::default()
@@ -73,20 +73,17 @@
     /// The dispatch correlation id that ties this session to the journal entry that spawned it.
     #[serde(default, skip_serializing_if = "Option::is_none")]
     pub correlation_id: Option<String>,
 }
 
 impl SessionOrigin {
     /// A session spawned by a chat turn — the S4 offer/return handoff.
     pub fn from_conversation(conversation_id: impl Into<String>) -> Self {
-        Self {
-            conversation_id: Some(conversation_id.into()),
-            correlation_id: None,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// A session with a dispatch correlation but **no parent conversation** — a cron, a webhook.
     pub fn from_correlation(correlation_id: impl Into<String>) -> Self {
         Self {
             conversation_id: None,
             correlation_id: Some(correlation_id.into()),
         }

*** result: Success
