*** crates/session/src/goal.rs:89:9: replace SessionOrigin::from_correlation -> Self with Default::default()

*** mutation diff:
--- crates/session/src/goal.rs
+++ replace SessionOrigin::from_correlation -> Self with Default::default()
@@ -81,20 +81,17 @@
         Self {
             conversation_id: Some(conversation_id.into()),
             correlation_id: None,
         }
     }
 
     /// A session with a dispatch correlation but **no parent conversation** — a cron, a webhook.
     pub fn from_correlation(correlation_id: impl Into<String>) -> Self {
-        Self {
-            conversation_id: None,
-            correlation_id: Some(correlation_id.into()),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Input to start a goal session (HTTP body / client contract).
 #[derive(Debug, Clone, PartialEq, Serialize, Deserialize)]
 pub struct GoalSpec {
     /// Optional client-supplied id; server generates a ULID when absent.
     #[serde(default, skip_serializing_if = "Option::is_none")]

*** result: Success
