*** crates/session/src/hub.rs:126:9: replace GoalSessionHub::register_pack with ()

*** mutation diff:
--- crates/session/src/hub.rs
+++ replace GoalSessionHub::register_pack with ()
@@ -118,19 +118,17 @@
         self
     }
 
     pub fn store(&self) -> &Arc<dyn SessionRecordStore> {
         &self.store
     }
 
     pub fn register_pack(&mut self, runner: Arc<dyn DomainPackRunner>) {
-        let id = runner.domain_id().to_string();
-        info!(domain = %id, "registered goal session domain pack");
-        self.packs.insert(id, runner);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn registered_domains(&self) -> Vec<String> {
         self.packs.keys().cloned().collect()
     }
 
     /// Start a goal session with **zero authority** — the fail-safe default. Prefer
     /// [`start_with_grant`](Self::start_with_grant); this exists for callers (and tests) that mean

---- life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted stdout ----

thread 'life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted' (25832) panicked at crates\session\src\life_demo.rs:468:14:
called `Result::unwrap()` on an `Err` value: "no domain pack registered for 'life' (have: [])"

---- life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer stdout ----

thread 'life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer' (4636) panicked at crates\session\src\life_demo.rs:405:14:
called `Result::unwrap()` on an `Err` value: "no domain pack registered for 'life' (have: [])"

---- life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted stdout ----

thread 'life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted' (23244) panicked at crates\session\src\life_demo.rs:534:14:
called `Result::unwrap()` on an `Err` value: "no domain pack registered for 'life' (have: [])"

failures:
    life_demo::tests::a_grant_is_never_widened_by_sending_input
    life_demo::tests::a_session_that_may_ask_but_not_write_is_refused_at_the_write
    life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted
    life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript
    life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer
    life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted
    life_demo::tests::life_domain_session_succeeds_without_coding_pack
    life_demo::tests::send_input_to_finished_session_errors

test result: FAILED. 8 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
