*** crates/session/src/hub.rs:132:9: replace GoalSessionHub::registered_domains -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- crates/session/src/hub.rs
+++ replace GoalSessionHub::registered_domains -> Vec<String> with vec!["xyzzy".into()]
@@ -124,17 +124,17 @@
 
     pub fn register_pack(&mut self, runner: Arc<dyn DomainPackRunner>) {
         let id = runner.domain_id().to_string();
         info!(domain = %id, "registered goal session domain pack");
         self.packs.insert(id, runner);
     }
 
     pub fn registered_domains(&self) -> Vec<String> {
-        self.packs.keys().cloned().collect()
+        vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Start a goal session with **zero authority** — the fail-safe default. Prefer
     /// [`start_with_grant`](Self::start_with_grant); this exists for callers (and tests) that mean
     /// "a session that may do nothing consequential and may not ask a human anything".
     pub async fn start(self: &Arc<Self>, goal: GoalSpec) -> Result<String, String> {
         self.start_with_grant(goal, SessionGrant::default()).await
     }

---- life_demo::tests::life_domain_session_succeeds_without_coding_pack stdout ----

thread 'life_demo::tests::life_domain_session_succeeds_without_coding_pack' (17884) panicked at crates\session\src\life_demo.rs:690:17:
assertion failed: hub.registered_domains().iter().any(|d| d == "life")

failures:
    life_demo::tests::life_domain_session_succeeds_without_coding_pack

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
