*** crates/session/src/hub.rs:139:9: replace GoalSessionHub::start -> Result<String, String> with Ok("xyzzy".into())

*** mutation diff:
--- crates/session/src/hub.rs
+++ replace GoalSessionHub::start -> Result<String, String> with Ok("xyzzy".into())
@@ -131,17 +131,17 @@
     pub fn registered_domains(&self) -> Vec<String> {
         self.packs.keys().cloned().collect()
     }
 
     /// Start a goal session with **zero authority** — the fail-safe default. Prefer
     /// [`start_with_grant`](Self::start_with_grant); this exists for callers (and tests) that mean
     /// "a session that may do nothing consequential and may not ask a human anything".
     pub async fn start(self: &Arc<Self>, goal: GoalSpec) -> Result<String, String> {
-        self.start_with_grant(goal, SessionGrant::default()).await
+        Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Start a goal session under an explicit authority `grant` (S6). Returns the session id
     /// immediately. Visibility is [`Foreground`](Visibility::Foreground) — a human is watching.
     ///
     /// The grant is resolved by the *server* from the session's profile — the kernel never reads
     /// config. It is recorded on the session and never widened afterwards.
     ///

---- life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted stdout ----

thread 'life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted' (6924) panicked at crates\session\src\life_demo.rs:537:9:
assertion `left == right` failed
  left: Unknown
 right: NotPermitted

---- life_demo::tests::unknown_domain_rejected stdout ----

thread 'life_demo::tests::unknown_domain_rejected' (25736) panicked at crates\session\src\life_demo.rs:714:14:
called `Result::unwrap_err()` on an `Ok` value: "xyzzy"

---- life_demo::tests::life_domain_session_succeeds_without_coding_pack stdout ----

thread 'life_demo::tests::life_domain_session_succeeds_without_coding_pack' (25848) panicked at crates\session\src\life_demo.rs:681:48:
called `Option::unwrap()` on a `None` value

failures:
    life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted
    life_demo::tests::life_domain_session_succeeds_without_coding_pack
    life_demo::tests::unknown_domain_rejected

test result: FAILED. 13 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
