*** crates/session/src/hub.rs:158:9: replace GoalSessionHub::start_with_grant -> Result<String, String> with Ok(String::new())

*** mutation diff:
--- crates/session/src/hub.rs
+++ replace GoalSessionHub::start_with_grant -> Result<String, String> with Ok(String::new())
@@ -150,17 +150,17 @@
     /// [`Capability::AskHuman`] gets no inbound input sender at all, so its pack receives an
     /// already-closed [`InputChannel`] and *cannot* block on a human who may not be there. This is
     /// the structural difference between an attended `/spawn` and an unattended cron.
     pub async fn start_with_grant(
         self: &Arc<Self>,
         goal: GoalSpec,
         grant: SessionGrant,
     ) -> Result<String, String> {
-        self.start_inner(goal, grant, Visibility::Foreground).await
+        Ok(String::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Start a **background** goal session — a cron, a webhook, a `delegate`d subagent. Same as
     /// [`start_with_grant`](Self::start_with_grant) but stamps [`Visibility::Background`].
     ///
     /// This is how unattended work becomes a *hosted* session (one-execution-engine plan E3/E4)
     /// rather than a read-only recording of work the hub never ran.
     pub async fn start_background(

---- life_demo::tests::unknown_domain_rejected stdout ----

thread 'life_demo::tests::unknown_domain_rejected' (17016) panicked at crates\session\src\life_demo.rs:714:14:
called `Result::unwrap_err()` on an `Ok` value: ""

---- life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted stdout ----

thread 'life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted' (12500) panicked at crates\session\src\life_demo.rs:537:9:
assertion `left == right` failed
  left: Unknown
 right: NotPermitted

---- life_demo::tests::a_grant_is_never_widened_by_sending_input stdout ----

thread 'life_demo::tests::a_grant_is_never_widened_by_sending_input' (14496) panicked at crates\session\src\life_demo.rs:630:48:
called `Option::unwrap()` on a `None` value

failures:
    life_demo::tests::a_grant_is_never_widened_by_sending_input
    life_demo::tests::a_session_that_may_ask_but_not_write_is_refused_at_the_write
    life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted
    life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer
    life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted
    life_demo::tests::life_domain_session_succeeds_without_coding_pack
    life_demo::tests::send_input_to_finished_session_errors
    life_demo::tests::unknown_domain_rejected

test result: FAILED. 8 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
