*** crates/session/src/hub.rs:171:9: replace GoalSessionHub::start_background -> Result<String, String> with Ok(String::new())

*** mutation diff:
--- crates/session/src/hub.rs
+++ replace GoalSessionHub::start_background -> Result<String, String> with Ok(String::new())
@@ -163,17 +163,17 @@
     ///
     /// This is how unattended work becomes a *hosted* session (one-execution-engine plan E3/E4)
     /// rather than a read-only recording of work the hub never ran.
     pub async fn start_background(
         self: &Arc<Self>,
         goal: GoalSpec,
         grant: SessionGrant,
     ) -> Result<String, String> {
-        self.start_inner(goal, grant, Visibility::Background).await
+        Ok(String::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn start_inner(
         self: &Arc<Self>,
         mut goal: GoalSpec,
         grant: SessionGrant,
         visibility: Visibility,
     ) -> Result<String, String> {

*** result: Success
