*** crates/session/src/hub.rs:181:12: delete ! in GoalSessionHub::start_inner

*** mutation diff:
--- crates/session/src/hub.rs
+++ delete ! in GoalSessionHub::start_inner
@@ -173,17 +173,17 @@
 
     async fn start_inner(
         self: &Arc<Self>,
         mut goal: GoalSpec,
         grant: SessionGrant,
         visibility: Visibility,
     ) -> Result<String, String> {
         let domain = goal.domain.as_str().to_string();
-        if !self.packs.contains_key(&domain) {
+        if  /* ~ changed by cargo-mutants ~ */self.packs.contains_key(&domain) {
             return Err(format!(
                 "no domain pack registered for '{domain}' (have: {:?})",
                 self.registered_domains()
             ));
         }
         if goal.description.trim().is_empty() {
             return Err("goal description must not be empty".into());
         }

---- life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted stdout ----

thread 'life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted' (8424) panicked at crates\session\src\life_demo.rs:534:14:
called `Result::unwrap()` on an `Err` value: "no domain pack registered for 'life' (have: [\"life\"])"

---- life_demo::tests::unknown_domain_rejected stdout ----

thread 'life_demo::tests::unknown_domain_rejected' (16184) panicked at crates\session\src\hub.rs:222:44:
checked above

---- life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer stdout ----

thread 'life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer' (3604) panicked at crates\session\src\life_demo.rs:405:14:
called `Result::unwrap()` on an `Err` value: "no domain pack registered for 'life' (have: [\"life\"])"

failures:
    life_demo::tests::a_grant_is_never_widened_by_sending_input
    life_demo::tests::a_session_that_may_ask_but_not_write_is_refused_at_the_write
    life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted
    life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer
    life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted
    life_demo::tests::life_domain_session_succeeds_without_coding_pack
    life_demo::tests::send_input_to_finished_session_errors
    life_demo::tests::unknown_domain_rejected

test result: FAILED. 8 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
