*** crates/session/src/hub.rs:281:9: replace GoalSessionHub::cancel -> Result<(), String> with Ok(())

*** mutation diff:
--- crates/session/src/hub.rs
+++ replace GoalSessionHub::cancel -> Result<(), String> with Ok(())
@@ -273,22 +273,17 @@
                         .await
                         .ok_or_else(|| format!("goal session '{id}' ended without a snapshot"));
                 }
             }
         }
     }
 
     pub async fn cancel(&self, id: &str) -> Result<(), String> {
-        let map = self.cancels.lock().await;
-        let tx = map
-            .get(id)
-            .ok_or_else(|| format!("session '{id}' not found or already finished"))?;
-        let _ = tx.send(true);
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Answer a **parked** session and put it back to work (E6-c).
     ///
     /// A session parked on a human across a daemon restart has no in-memory state left — no pack
     /// running, no input channel, no cancel handle. What it does have is its **transcript**, and for
     /// a pack that can rebuild itself from that, "resume" is simply: record the answer as a turn,
     /// then run the pack again. It reads its own dialogue back on start and picks up the

*** result: Success
