*** crates/session/src/hub.rs:311:9: replace GoalSessionHub::resume -> Result<(), SendInputError> with Ok(())

*** mutation diff:
--- crates/session/src/hub.rs
+++ replace GoalSessionHub::resume -> Result<(), SendInputError> with Ok(())
@@ -303,71 +303,17 @@
     /// ([`DomainPackRunner::can_resume`]) — the coding pack says no once the build has started,
     /// because re-running it would redo real filesystem work with no checkpoint. That refusal is
     /// honest rather than optimistic: the session stays parked and says so.
     pub async fn resume(
         self: &Arc<Self>,
         id: &str,
         answer: impl Into<String>,
     ) -> Result<(), SendInputError> {
-        let answer = answer.into();
-        let record = self.store.get(id).await.ok_or(SendInputError::Unknown)?;
-
-        if !record.grant.grants_ask_human() {
-            return Err(SendInputError::NotPermitted);
-        }
-        if record.status != SessionStatus::Parked {
-            // Not parked: either it is live (and `send_input` is the right door), or it is over.
-            return Err(if record.status.is_terminal() {
-                SendInputError::Terminal
-            } else {
-                SendInputError::Closed
-            });
-        }
-
-        let Some(pack) = self.packs.get(record.goal.domain.as_str()).cloned() else {
-            return Err(SendInputError::Terminal);
-        };
-        let ctx = PackContext::new(&record.grant, self.store.clone(), id);
-        if !pack.can_resume(&ctx).await {
-            // The pack cannot rebuild itself from the transcript — for the coding pack this means
-            // the build had already started. Leave it parked and honest rather than silently
-            // re-running work that touched the filesystem.
-            return Err(SendInputError::Parked);
-        }
-
-        // The answer joins the transcript first, so the pack sees it on `prior_turns()`.
-        self.store
-            .append_turn(id, TurnAuthor::User, answer.clone())
-            .await;
-        // …and the event, so a live surface renders it and `awaiting_input` clears.
-        self.store
-            .push_event(SessionEvent::new(
-                id,
-                SessionEventKind::HumanInput { text: answer },
-            ))
-            .await;
-
-        let mut goal = record.goal.clone();
-        goal.id = Some(id.to_string());
-
-        let (cancel_tx, cancel_rx) = watch::channel(false);
-        self.cancels.lock().await.insert(id.to_string(), cancel_tx);
-        let (input_tx, input_rx) = mpsc::channel::<HumanInput>(INPUT_CHANNEL_CAPACITY);
-        self.inputs.lock().await.insert(id.to_string(), input_tx);
-        let idle_budget = goal.max_idle_secs.map(Duration::from_secs);
-        let inputs = InputChannel::new(input_rx, idle_budget);
-
-        let hub = Arc::clone(self);
-        let session_id = id.to_string();
-        tokio::spawn(async move {
-            hub.run_session(session_id, goal, pack, inputs, cancel_rx)
-                .await;
-        });
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Deliver a human message into a running interactive session. Errors if the session is
     /// unknown or finished (its input sender was removed at teardown) — distinguished as
     /// [`SendInputError::Unknown`] vs [`SendInputError::Terminal`] so the HTTP layer can answer 404
     /// vs 409. The accepted input is **echoed into the transcript** as a
     /// [`SessionEventKind::HumanInput`] event here — so the history is complete regardless of what
     /// the pack does with it.

---- life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript stdout ----

thread 'life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript' (18476) panicked at crates\session\src\life_demo.rs:380:9:
session parked-2 did not finish

failures:
    life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.57s

*** result: Failure(101)
