*** crates/session/src/hub.rs:314:12: delete ! in GoalSessionHub::resume

*** mutation diff:
--- crates/session/src/hub.rs
+++ delete ! in GoalSessionHub::resume
@@ -306,17 +306,17 @@
     pub async fn resume(
         self: &Arc<Self>,
         id: &str,
         answer: impl Into<String>,
     ) -> Result<(), SendInputError> {
         let answer = answer.into();
         let record = self.store.get(id).await.ok_or(SendInputError::Unknown)?;
 
-        if !record.grant.grants_ask_human() {
+        if  /* ~ changed by cargo-mutants ~ */record.grant.grants_ask_human() {
             return Err(SendInputError::NotPermitted);
         }
         if record.status != SessionStatus::Parked {
             // Not parked: either it is live (and `send_input` is the right door), or it is over.
             return Err(if record.status.is_terminal() {
                 SendInputError::Terminal
             } else {
                 SendInputError::Closed

---- life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript stdout ----

thread 'life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript' (272) panicked at crates\session\src\life_demo.rs:852:14:
a resumable parked session must accept its answer: NotPermitted

failures:
    life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
