*** crates/session/src/hub.rs:317:26: replace != with == in GoalSessionHub::resume

*** mutation diff:
--- crates/session/src/hub.rs
+++ replace != with == in GoalSessionHub::resume
@@ -309,17 +309,17 @@
         answer: impl Into<String>,
     ) -> Result<(), SendInputError> {
         let answer = answer.into();
         let record = self.store.get(id).await.ok_or(SendInputError::Unknown)?;
 
         if !record.grant.grants_ask_human() {
             return Err(SendInputError::NotPermitted);
         }
-        if record.status != SessionStatus::Parked {
+        if record.status == /* ~ changed by cargo-mutants ~ */ SessionStatus::Parked {
             // Not parked: either it is live (and `send_input` is the right door), or it is over.
             return Err(if record.status.is_terminal() {
                 SendInputError::Terminal
             } else {
                 SendInputError::Closed
             });
         }

---- life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript stdout ----

thread 'life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript' (18012) panicked at crates\session\src\life_demo.rs:852:14:
a resumable parked session must accept its answer: Closed

failures:
    life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
