*** crates/session/src/hub.rs:330:12: delete ! in GoalSessionHub::resume

*** mutation diff:
--- crates/session/src/hub.rs
+++ delete ! in GoalSessionHub::resume
@@ -322,17 +322,17 @@
                 SendInputError::Closed
             });
         }
 
         let Some(pack) = self.packs.get(record.goal.domain.as_str()).cloned() else {
             return Err(SendInputError::Terminal);
         };
         let ctx = PackContext::new(&record.grant, self.store.clone(), id);
-        if !pack.can_resume(&ctx).await {
+        if  /* ~ changed by cargo-mutants ~ */pack.can_resume(&ctx).await {
             // The pack cannot rebuild itself from the transcript — for the coding pack this means
             // the build had already started. Leave it parked and honest rather than silently
             // re-running work that touched the filesystem.
             return Err(SendInputError::Parked);
         }
 
         // The answer joins the transcript first, so the pack sees it on `prior_turns()`.
         self.store

---- life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript stdout ----

thread 'life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript' (8240) panicked at crates\session\src\life_demo.rs:852:14:
a resumable parked session must accept its answer: Parked

failures:
    life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
