*** crates/session/src/hub.rs:379:9: replace GoalSessionHub::send_input -> Result<(), SendInputError> with Ok(())

*** mutation diff:
--- crates/session/src/hub.rs
+++ replace GoalSessionHub::send_input -> Result<(), SendInputError> with Ok(())
@@ -371,66 +371,17 @@
     /// vs 409. The accepted input is **echoed into the transcript** as a
     /// [`SessionEventKind::HumanInput`] event here — so the history is complete regardless of what
     /// the pack does with it.
     pub async fn send_input(
         &self,
         id: &str,
         text: impl Into<String>,
     ) -> Result<(), SendInputError> {
-        let text = text.into();
-        // Clone the sender out before awaiting the send, so the lock isn't held across `.await`.
-        let sender = {
-            let map = self.inputs.lock().await;
-            map.get(id).cloned()
-        };
-        let sender = match sender {
-            Some(s) => s,
-            // No live input sender — FOUR different reasons, and the caller needs to tell them
-            // apart. Consult the record: a session that never held `AskHuman` was never *allowed*
-            // input (403), which is a different fact from one that has since finished (409), one
-            // that is parked mid-question across a restart (409, but *not* finished), or one that
-            // never existed (404). Without these checks each masquerades as "you were too late",
-            // when the truth may be "you were never allowed" or "it is still waiting for you".
-            //
-            // `Parked` was added by E6 and this match was not updated with it, so a parked session
-            // was told it "has already finished" — the one thing it definitively has not done.
-            None => {
-                return Err(match self.store.get(id).await {
-                    Some(record) if !record.grant.grants_ask_human() => {
-                        SendInputError::NotPermitted
-                    }
-                    Some(record) if record.status == SessionStatus::Parked => {
-                        SendInputError::Parked
-                    }
-                    Some(_) => SendInputError::Terminal,
-                    None => SendInputError::Unknown,
-                });
-            }
-        };
-        sender
-            .send(HumanInput::new(text.clone()))
-            .await
-            .map_err(|_| SendInputError::Closed)?;
-
-        // Recorded **twice, on purpose**, because these are two different things:
-        //
-        // * the event is what a live subscriber sees (it is what clears the `awaiting_input` badge);
-        // * the turn is what the human *said* — it belongs in the message DAG, so it is searchable
-        //   and so a fork taken later carries it.
-        //
-        // The pack does not have to remember to do this: whatever a human says into a session is
-        // dialogue by definition, so the kernel records it and no pack can forget to.
-        self.store
-            .append_turn(id, TurnAuthor::User, text.clone())
-            .await;
-        self.store
-            .push_event(SessionEvent::new(id, SessionEventKind::HumanInput { text }))
-            .await;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn snapshot(&self, id: &str) -> Option<SessionSnapshot> {
         let session = self.store.get(id).await?;
         let events = self.store.events(id).await.unwrap_or_default();
         Some(SessionSnapshot { session, events })
     }

---- life_demo::tests::send_input_to_unknown_session_is_distinct_from_terminal stdout ----

thread 'life_demo::tests::send_input_to_unknown_session_is_distinct_from_terminal' (4676) panicked at crates\session\src\life_demo.rs:652:57:
called `Result::unwrap_err()` on an `Ok` value: ()

---- life_demo::tests::a_parked_session_is_not_told_it_finished stdout ----

thread 'life_demo::tests::a_parked_session_is_not_told_it_finished' (3296) panicked at crates\session\src\life_demo.rs:752:14:
a parked session has no live pack to receive the answer: ()

---- life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted stdout ----

thread 'life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted' (22008) panicked at crates\session\src\life_demo.rs:536:60:
called `Result::unwrap_err()` on an `Ok` value: ()

failures:
    life_demo::tests::a_grant_is_never_widened_by_sending_input
    life_demo::tests::a_parked_session_is_not_told_it_finished
    life_demo::tests::a_session_that_may_ask_but_not_write_is_refused_at_the_write
    life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted
    life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer
    life_demo::tests::send_input_to_finished_session_errors
    life_demo::tests::send_input_to_unknown_session_is_distinct_from_terminal

test result: FAILED. 9 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.57s

*** result: Failure(101)
