*** crates/session/src/hub.rs:398:37: replace match guard !record.grant.grants_ask_human() with false in GoalSessionHub::send_input

*** mutation diff:
--- crates/session/src/hub.rs
+++ replace match guard !record.grant.grants_ask_human() with false in GoalSessionHub::send_input
@@ -390,17 +390,17 @@
             // that is parked mid-question across a restart (409, but *not* finished), or one that
             // never existed (404). Without these checks each masquerades as "you were too late",
             // when the truth may be "you were never allowed" or "it is still waiting for you".
             //
             // `Parked` was added by E6 and this match was not updated with it, so a parked session
             // was told it "has already finished" — the one thing it definitively has not done.
             None => {
                 return Err(match self.store.get(id).await {
-                    Some(record) if !record.grant.grants_ask_human() => {
+                    Some(record) if false /* ~ changed by cargo-mutants ~ */ => {
                         SendInputError::NotPermitted
                     }
                     Some(record) if record.status == SessionStatus::Parked => {
                         SendInputError::Parked
                     }
                     Some(_) => SendInputError::Terminal,
                     None => SendInputError::Unknown,
                 });

---- life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted stdout ----

thread 'life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted' (6632) panicked at crates\session\src\life_demo.rs:537:9:
assertion `left == right` failed
  left: Terminal
 right: NotPermitted

failures:
    life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
