*** crates/session/src/hub.rs:398:37: delete ! in GoalSessionHub::send_input

*** mutation diff:
--- crates/session/src/hub.rs
+++ delete ! in GoalSessionHub::send_input
@@ -390,17 +390,17 @@
             // that is parked mid-question across a restart (409, but *not* finished), or one that
             // never existed (404). Without these checks each masquerades as "you were too late",
             // when the truth may be "you were never allowed" or "it is still waiting for you".
             //
             // `Parked` was added by E6 and this match was not updated with it, so a parked session
             // was told it "has already finished" — the one thing it definitively has not done.
             None => {
                 return Err(match self.store.get(id).await {
-                    Some(record) if !record.grant.grants_ask_human() => {
+                    Some(record) if  /* ~ changed by cargo-mutants ~ */record.grant.grants_ask_human() => {
                         SendInputError::NotPermitted
                     }
                     Some(record) if record.status == SessionStatus::Parked => {
                         SendInputError::Parked
                     }
                     Some(_) => SendInputError::Terminal,
                     None => SendInputError::Unknown,
                 });

---- life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted stdout ----

thread 'life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted' (18064) panicked at crates\session\src\life_demo.rs:537:9:
assertion `left == right` failed
  left: Terminal
 right: NotPermitted

---- life_demo::tests::a_parked_session_is_not_told_it_finished stdout ----

thread 'life_demo::tests::a_parked_session_is_not_told_it_finished' (3512) panicked at crates\session\src\life_demo.rs:754:9:
a parked session must report Parked, not Terminal: NotPermitted

---- life_demo::tests::send_input_to_finished_session_errors stdout ----

thread 'life_demo::tests::send_input_to_finished_session_errors' (9880) panicked at crates\session\src\life_demo.rs:508:9:
assertion `left == right` failed
  left: NotPermitted
 right: Terminal

failures:
    life_demo::tests::a_parked_session_is_not_told_it_finished
    life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted
    life_demo::tests::send_input_to_finished_session_errors

test result: FAILED. 13 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
