*** crates/session/src/hub.rs:401:37: replace match guard record.status == SessionStatus::Parked with false in GoalSessionHub::send_input

*** mutation diff:
--- crates/session/src/hub.rs
+++ replace match guard record.status == SessionStatus::Parked with false in GoalSessionHub::send_input
@@ -393,17 +393,17 @@
             //
             // `Parked` was added by E6 and this match was not updated with it, so a parked session
             // was told it "has already finished" — the one thing it definitively has not done.
             None => {
                 return Err(match self.store.get(id).await {
                     Some(record) if !record.grant.grants_ask_human() => {
                         SendInputError::NotPermitted
                     }
-                    Some(record) if record.status == SessionStatus::Parked => {
+                    Some(record) if false /* ~ changed by cargo-mutants ~ */ => {
                         SendInputError::Parked
                     }
                     Some(_) => SendInputError::Terminal,
                     None => SendInputError::Unknown,
                 });
             }
         };
         sender

---- life_demo::tests::a_parked_session_is_not_told_it_finished stdout ----

thread 'life_demo::tests::a_parked_session_is_not_told_it_finished' (5016) panicked at crates\session\src\life_demo.rs:754:9:
a parked session must report Parked, not Terminal: Terminal

failures:
    life_demo::tests::a_parked_session_is_not_told_it_finished

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
