*** crates/session/src/hub.rs:432:9: replace GoalSessionHub::snapshot -> Option<SessionSnapshot> with None

*** mutation diff:
--- crates/session/src/hub.rs
+++ replace GoalSessionHub::snapshot -> Option<SessionSnapshot> with None
@@ -424,19 +424,17 @@
             .await;
         self.store
             .push_event(SessionEvent::new(id, SessionEventKind::HumanInput { text }))
             .await;
         Ok(())
     }
 
     pub async fn snapshot(&self, id: &str) -> Option<SessionSnapshot> {
-        let session = self.store.get(id).await?;
-        let events = self.store.events(id).await.unwrap_or_default();
-        Some(SessionSnapshot { session, events })
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn list(&self) -> Vec<GoalSessionRecord> {
         self.store.list().await
     }
 
     async fn run_session(
         &self,

---- life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted stdout ----

thread 'life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted' (18736) panicked at crates\session\src\life_demo.rs:375:47:
called `Option::unwrap()` on a `None` value

---- life_demo::tests::life_domain_session_succeeds_without_coding_pack stdout ----

thread 'life_demo::tests::life_domain_session_succeeds_without_coding_pack' (17060) panicked at crates\session\src\life_demo.rs:681:48:
called `Option::unwrap()` on a `None` value

---- life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript stdout ----

thread 'life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript' (9656) panicked at crates\session\src\life_demo.rs:375:47:
called `Option::unwrap()` on a `None` value

failures:
    life_demo::tests::a_grant_is_never_widened_by_sending_input
    life_demo::tests::a_session_that_may_ask_but_not_write_is_refused_at_the_write
    life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript
    life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer
    life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted
    life_demo::tests::life_domain_session_succeeds_without_coding_pack
    life_demo::tests::send_input_to_finished_session_errors

test result: FAILED. 9 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
