*** crates/session/src/hub.rs:57:9: replace <impl std::fmt::Display for SendInputError>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/session/src/hub.rs
+++ replace <impl std::fmt::Display for SendInputError>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -49,33 +49,17 @@
     Parked,
     /// The session's input channel closed underneath us — a rare teardown race between the lookup
     /// and the send.
     Closed,
 }
 
 impl std::fmt::Display for SendInputError {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        match self {
-            Self::Unknown => write!(f, "no such goal session"),
-            Self::Terminal => {
-                write!(f, "goal session has already finished — not accepting input")
-            }
-            Self::NotPermitted => write!(
-                f,
-                "goal session's grant does not include AskHuman — it cannot receive human input"
-            ),
-            Self::Parked => write!(
-                f,
-                "goal session is parked: the daemon restarted while it was waiting on you, so the \
-                 question it holds is still there but no pack is running to receive the answer. \
-                 It has NOT finished — it cannot be resumed yet (E6-c)"
-            ),
-            Self::Closed => write!(f, "goal session input channel is closed"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for SendInputError {}
 
 /// Out-of-band ping when a session awaits input and nobody is watching the event bus (E5).
 ///
 /// Implemented by the composition root (e.g. wrapping `liberado_notify::Notifier`) so the kernel

---- life_demo::tests::a_parked_session_is_not_told_it_finished stdout ----

thread 'life_demo::tests::a_parked_session_is_not_told_it_finished' (23564) panicked at crates\session\src\life_demo.rs:763:9:
and must say what it actually is:

failures:
    life_demo::tests::a_parked_session_is_not_told_it_finished

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
