*** crates/session/src/life_demo.rs:142:9: replace <impl DomainPackRunner for LifeOpsDemoRunner>::domain_id -> &str with ""

*** mutation diff:
--- crates/session/src/life_demo.rs
+++ replace <impl DomainPackRunner for LifeOpsDemoRunner>::domain_id -> &str with ""
@@ -134,17 +134,17 @@
             InputOutcome::Closed => Err(PackError::Cancelled),
         }
     }
 }
 
 #[async_trait]
 impl DomainPackRunner for LifeOpsDemoRunner {
     fn domain_id(&self) -> &str {
-        LIFE_OPS_DOMAIN
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     async fn run(
         &self,
         session_id: &str,
         goal: &GoalSpec,
         ctx: &PackContext<'_>,
         events: Sender<SessionEvent>,

---- life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted stdout ----

thread 'life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted' (13680) panicked at crates\session\src\life_demo.rs:534:14:
called `Result::unwrap()` on an `Err` value: "no domain pack registered for 'life' (have: [\"\"])"

---- life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer stdout ----

thread 'life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer' (25160) panicked at crates\session\src\life_demo.rs:405:14:
called `Result::unwrap()` on an `Err` value: "no domain pack registered for 'life' (have: [\"\"])"

---- life_demo::tests::a_grant_is_never_widened_by_sending_input stdout ----

thread 'life_demo::tests::a_grant_is_never_widened_by_sending_input' (23580) panicked at crates\session\src\life_demo.rs:624:14:
called `Result::unwrap()` on an `Err` value: "no domain pack registered for 'life' (have: [\"\"])"

failures:
    life_demo::tests::a_grant_is_never_widened_by_sending_input
    life_demo::tests::a_session_that_may_ask_but_not_write_is_refused_at_the_write
    life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted
    life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer
    life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted
    life_demo::tests::life_domain_session_succeeds_without_coding_pack
    life_demo::tests::send_input_to_finished_session_errors

test result: FAILED. 9 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
