*** crates/session/src/life_demo.rs:165:24: replace && with || in <impl DomainPackRunner for LifeOpsDemoRunner>::run

*** mutation diff:
--- crates/session/src/life_demo.rs
+++ replace && with || in <impl DomainPackRunner for LifeOpsDemoRunner>::run
@@ -157,17 +157,17 @@
             .and_then(|v| v.as_bool())
             .unwrap_or(false);
 
         // Asking a human is a *capability*, not a mode the caller can simply assert. A session
         // whose grant omits `AskHuman` (an unattended cron, a narrow research hat) falls through to
         // the non-interactive path and gets the job done without a person — rather than blocking on
         // one who was never going to answer. The kernel has already closed its input channel; this
         // check just lets the pack degrade gracefully instead of tripping over the closure.
-        if wants_input && ctx.can(&Capability::AskHuman) {
+        if wants_input || /* ~ changed by cargo-mutants ~ */ ctx.can(&Capability::AskHuman) {
             return self
                 .run_interactive(session_id, ctx, events, inputs, cancel)
                 .await;
         }
 
         // `role` is the worked example of an opaque, pack-parsed override: the config stack never
         // interprets it (`[[session_profiles]].overrides`), this pack does.
         let role = ctx

---- life_demo::tests::send_input_to_finished_session_errors stdout ----

thread 'life_demo::tests::send_input_to_finished_session_errors' (12764) panicked at crates\session\src\life_demo.rs:380:9:
session 01KXGDS4AM8ZGBV8EVD0YB9JVX did not finish

failures:
    life_demo::tests::send_input_to_finished_session_errors

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.56s

*** result: Failure(101)
