*** crates/session/src/life_demo.rs:332:5: replace slugify -> String with "xyzzy".into()

*** mutation diff:
--- crates/session/src/life_demo.rs
+++ replace slugify -> String with "xyzzy".into()
@@ -324,29 +324,17 @@
                 "note": "deterministic second-domain proof — no coder-tools"
             }),
         })
     }
 }
 
 /// Lowercase, non-alphanumerics to `-`, collapsed — enough for a demo note path.
 fn slugify(s: &str) -> String {
-    let mut out = String::new();
-    let mut prev_dash = false;
-    for ch in s.trim().chars() {
-        if ch.is_ascii_alphanumeric() {
-            out.push(ch.to_ascii_lowercase());
-            prev_dash = false;
-        } else if !prev_dash {
-            out.push('-');
-            prev_dash = true;
-        }
-    }
-    let slug = out.trim_matches('-').to_string();
-    if slug.is_empty() { "note".into() } else { slug }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::goal::{DomainHint, SessionGrant};
     use crate::hub::GoalSessionHub;
     use crate::store::GoalSessionStore;

---- life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer stdout ----

thread 'life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer' (5676) panicked at crates\session\src\life_demo.rs:431:9:
assertion failed: snap.session.result.as_ref().unwrap().artifacts[0].contains("weekly-review")

failures:
    life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
