*** crates/session/src/life_demo.rs:338:19: delete ! in slugify

*** mutation diff:
--- crates/session/src/life_demo.rs
+++ delete ! in slugify
@@ -330,17 +330,17 @@
 /// Lowercase, non-alphanumerics to `-`, collapsed — enough for a demo note path.
 fn slugify(s: &str) -> String {
     let mut out = String::new();
     let mut prev_dash = false;
     for ch in s.trim().chars() {
         if ch.is_ascii_alphanumeric() {
             out.push(ch.to_ascii_lowercase());
             prev_dash = false;
-        } else if !prev_dash {
+        } else if  /* ~ changed by cargo-mutants ~ */prev_dash {
             out.push('-');
             prev_dash = true;
         }
     }
     let slug = out.trim_matches('-').to_string();
     if slug.is_empty() { "note".into() } else { slug }
 }

---- life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer stdout ----

thread 'life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer' (2696) panicked at crates\session\src\life_demo.rs:443:9:
assertion failed: snap.session.result.as_ref().unwrap().artifacts[0].contains("weekly-review")

failures:
    life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
