*** crates/session/src/life_demo.rs:83:20: delete ! in LifeOpsDemoRunner::run_interactive

*** mutation diff:
--- crates/session/src/life_demo.rs
+++ delete ! in LifeOpsDemoRunner::run_interactive
@@ -75,17 +75,17 @@
                             name: "vault_write_note".into(),
                             args_preview: format!("{path}: {title}"),
                         },
                     ))
                     .await;
 
                 // The capability check, at the point of the consequential act — not at dispatch,
                 // not by convention. A profile granted only `Read` reaches here and is refused.
-                if !ctx.can(&Capability::Write(Zone::vault(NOTES_ZONE))) {
+                if  /* ~ changed by cargo-mutants ~ */ctx.can(&Capability::Write(Zone::vault(NOTES_ZONE))) {
                     let _ = events
                         .send(SessionEvent::new(
                             session_id,
                             SessionEventKind::ToolFinished {
                                 name: "vault_write_note".into(),
                                 ok: false,
                                 result_preview: format!(
                                     "denied: grant lacks Write(vault:{NOTES_ZONE})"

---- life_demo::tests::a_session_that_may_ask_but_not_write_is_refused_at_the_write stdout ----

thread 'life_demo::tests::a_session_that_may_ask_but_not_write_is_refused_at_the_write' (24944) panicked at crates\session\src\life_demo.rs:587:9:
assertion `left == right` failed
  left: Succeeded
 right: Failed

---- life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer stdout ----

thread 'life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer' (2436) panicked at crates\session\src\life_demo.rs:428:9:
assertion `left == right` failed
  left: Failed
 right: Succeeded

failures:
    life_demo::tests::a_session_that_may_ask_but_not_write_is_refused_at_the_write
    life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer

test result: FAILED. 14 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
