*** crates/session/src/record_store.rs:86:9: replace SessionRecordStore::live_subscriber_count -> usize with 0

*** mutation diff:
--- crates/session/src/record_store.rs
+++ replace SessionRecordStore::live_subscriber_count -> usize with 0
@@ -78,18 +78,17 @@
     async fn push_event(&self, event: SessionEvent);
 
     /// How many live subscribers are watching this session's event bus right now.
     ///
     /// Used for out-of-band notification (E5): when a pack emits `AwaitingInput` and this is 0,
     /// nobody is watching the TUI/stream, so ping the human. Default `0` — stores without a bus
     /// (tests) treat every await as unwatched.
     async fn live_subscriber_count(&self, id: &str) -> usize {
-        let _ = id;
-        0
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Append one **turn** — a conversational message — to this session's transcript, parented onto
     /// whatever the session's newest node is.
     ///
     /// This is the difference between an *observation* and a *conversation*. A pack's tool call is
     /// an [`event`](SessionEvent): something that happened, worth watching, not something anyone
     /// said. Its clarifying question, and your answer to it, are **turns**: they are the dialogue,

*** result: Success
