*** crates/session/src/runner.rs:158:9: replace PackContext<'_>::prior_turns -> Vec<(TurnAuthor, String)> with vec![]

*** mutation diff:
--- crates/session/src/runner.rs
+++ replace PackContext<'_>::prior_turns -> Vec<(TurnAuthor, String)> with vec![]
@@ -150,17 +150,17 @@
     /// read it back cannot pick the conversation up where it stopped — it can only start over and
     /// ask you everything again, which is not resuming, it is forgetting politely.
     ///
     /// This deliberately widens `PackContext`, which until now exposed *only* `record_turn` on the
     /// principle that a pack should not see the store. The principle stands — a pack still cannot
     /// reach the store, only its own transcript — but "write-only memory" was not a principle, it
     /// was an oversight that happened to be invisible until something needed to remember.
     pub async fn prior_turns(&self) -> Vec<(TurnAuthor, String)> {
-        self.store.turns(&self.session_id).await
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// The events already recorded for this session — what already *happened*, as opposed to what
     /// was *said* ([`prior_turns`](Self::prior_turns)).
     ///
     /// A pack needs this to answer [`DomainPackRunner::can_resume`]: "did I get far enough to have
     /// touched something I cannot un-touch?" is a question about events (a role started, a tool
     /// ran), not about dialogue.

---- life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript stdout ----

thread 'life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript' (18064) panicked at crates\session\src\life_demo.rs:861:9:
the pack must remember the question it asked: []

failures:
    life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
