*** crates/session/src/runner.rs:176:9: replace PackContext<'_>::can -> bool with true

*** mutation diff:
--- crates/session/src/runner.rs
+++ replace PackContext<'_>::can -> bool with true
@@ -168,17 +168,17 @@
         self.store
             .events(&self.session_id)
             .await
             .unwrap_or_default()
     }
 
     /// Whether this session holds `cap`. The one call a pack should make before a consequential act.
     pub fn can(&self, cap: &Capability) -> bool {
-        self.grant.capabilities.contains(cap)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// The pack's opaque overrides (an empty table when the profile set none).
     pub fn overrides(&self) -> &serde_json::Value {
         &self.grant.overrides
     }
 
     /// The profile name this session runs under, if any.

---- life_demo::tests::a_session_that_may_ask_but_not_write_is_refused_at_the_write stdout ----

thread 'life_demo::tests::a_session_that_may_ask_but_not_write_is_refused_at_the_write' (5428) panicked at crates\session\src\life_demo.rs:587:9:
assertion `left == right` failed
  left: Succeeded
 right: Failed

failures:
    life_demo::tests::a_session_that_may_ask_but_not_write_is_refused_at_the_write

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
