*** crates/session/src/runner.rs:176:9: replace PackContext<'_>::can -> bool with false

*** mutation diff:
--- crates/session/src/runner.rs
+++ replace PackContext<'_>::can -> bool with false
@@ -168,17 +168,17 @@
         self.store
             .events(&self.session_id)
             .await
             .unwrap_or_default()
     }
 
     /// Whether this session holds `cap`. The one call a pack should make before a consequential act.
     pub fn can(&self, cap: &Capability) -> bool {
-        self.grant.capabilities.contains(cap)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// The pack's opaque overrides (an empty table when the profile set none).
     pub fn overrides(&self) -> &serde_json::Value {
         &self.grant.overrides
     }
 
     /// The profile name this session runs under, if any.

---- life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted stdout ----

thread 'life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted' (948) panicked at crates\session\src\life_demo.rs:471:9:
assertion `left == right` failed
  left: Succeeded
 right: BudgetExhausted

---- life_demo::tests::a_session_that_may_ask_but_not_write_is_refused_at_the_write stdout ----

thread 'life_demo::tests::a_session_that_may_ask_but_not_write_is_refused_at_the_write' (21440) panicked at crates\session\src\life_demo.rs:583:52:
called `Result::unwrap()` on an `Err` value: Terminal

---- life_demo::tests::a_grant_is_never_widened_by_sending_input stdout ----

thread 'life_demo::tests::a_grant_is_never_widened_by_sending_input' (26052) panicked at crates\session\src\life_demo.rs:636:29:
session never awaited input

failures:
    life_demo::tests::a_grant_is_never_widened_by_sending_input
    life_demo::tests::a_session_that_may_ask_but_not_write_is_refused_at_the_write
    life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer
    life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted

test result: FAILED. 12 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.57s

*** result: Failure(101)
