*** crates/session/src/runner.rs:181:9: replace PackContext<'_>::overrides -> &serde_json::Value with Box::leak(Box::new(Default::default()))

*** mutation diff:
--- crates/session/src/runner.rs
+++ replace PackContext<'_>::overrides -> &serde_json::Value with Box::leak(Box::new(Default::default()))
@@ -173,17 +173,17 @@
 
     /// Whether this session holds `cap`. The one call a pack should make before a consequential act.
     pub fn can(&self, cap: &Capability) -> bool {
         self.grant.capabilities.contains(cap)
     }
 
     /// The pack's opaque overrides (an empty table when the profile set none).
     pub fn overrides(&self) -> &serde_json::Value {
-        &self.grant.overrides
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     /// The profile name this session runs under, if any.
     pub fn profile(&self) -> Option<&str> {
         self.grant.profile.as_deref()
     }
 }

*** result: Success
