*** crates/session/src/runner.rs:186:9: replace PackContext<'_>::profile -> Option<&str> with Some("")

*** mutation diff:
--- crates/session/src/runner.rs
+++ replace PackContext<'_>::profile -> Option<&str> with Some("")
@@ -178,17 +178,17 @@
 
     /// The pack's opaque overrides (an empty table when the profile set none).
     pub fn overrides(&self) -> &serde_json::Value {
         &self.grant.overrides
     }
 
     /// The profile name this session runs under, if any.
     pub fn profile(&self) -> Option<&str> {
-        self.grant.profile.as_deref()
+        Some("") /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// One domain pack's goal-session implementation (coding, life, …).
 #[async_trait]
 pub trait DomainPackRunner: Send + Sync {
     fn domain_id(&self) -> &str;

*** result: Success
