*** crates/session/src/runner.rs:230:9: replace DomainPackRunner::can_resume -> bool with true

*** mutation diff:
--- crates/session/src/runner.rs
+++ replace DomainPackRunner::can_resume -> bool with true
@@ -222,11 +222,11 @@
     /// happens between a resume and the next human gate.** Intake ends at a draft contract the human
     /// must accept. An approximate reconstruction that lands in front of a human for approval is
     /// safe; an approximate reconstruction that starts editing files is not. That distinction, and
     /// not convenience, is why this method exists instead of a blanket `resumable: bool`.
     ///
     /// Default `false` so a new pack is un-resumable until someone has actually thought about it —
     /// the safe answer is the one you get by not deciding.
     async fn can_resume(&self, _ctx: &PackContext<'_>) -> bool {
-        false
+        true /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
