*** crates/session/src/store.rs:101:66: replace != with == in GoalSessionStore::open

*** mutation diff:
--- crates/session/src/store.rs
+++ replace != with == in GoalSessionStore::open
@@ -93,17 +93,17 @@
             return Self::new();
         }
 
         let mut map = HashMap::new();
         match std::fs::read_dir(&dir) {
             Ok(entries) => {
                 for entry in entries.flatten() {
                     let path = entry.path();
-                    if path.extension().and_then(|e| e.to_str()) != Some("jsonl") {
+                    if path.extension().and_then(|e| e.to_str()) == /* ~ changed by cargo-mutants ~ */ Some("jsonl") {
                         continue;
                     }
                     match replay_file(&path) {
                         Some(inner) => {
                             map.insert(inner.record.id.clone(), inner);
                         }
                         None => {
                             warn!(path = %path.display(), "goal-session store: skipped an unreadable log")

---- store::tests::mid_execution_session_is_coerced_to_failed_on_rehydrate stdout ----

thread 'store::tests::mid_execution_session_is_coerced_to_failed_on_rehydrate' (13932) panicked at crates\session\src\store.rs:564:45:
called `Option::unwrap()` on a `None` value

---- store::tests::awaiting_session_is_parked_on_rehydrate_not_failed stdout ----

thread 'store::tests::awaiting_session_is_parked_on_rehydrate_not_failed' (17992) panicked at crates\session\src\store.rs:534:44:
called `Option::unwrap()` on a `None` value

---- store::tests::durable_store_rehydrates_a_finished_session stdout ----

thread 'store::tests::durable_store_rehydrates_a_finished_session' (4236) panicked at crates\session\src\store.rs:499:44:
session should rehydrate

failures:
    store::tests::awaiting_session_is_parked_on_rehydrate_not_failed
    store::tests::durable_store_rehydrates_a_finished_session
    store::tests::mid_execution_session_is_coerced_to_failed_on_rehydrate

test result: FAILED. 13 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
