*** crates/session/src/store.rs:134:9: replace GoalSessionStore::append with ()

*** mutation diff:
--- crates/session/src/store.rs
+++ replace GoalSessionStore::append with ()
@@ -126,35 +126,17 @@
             inner: Arc::new(Mutex::new(map)),
             dir: Some(Arc::new(dir)),
         }
     }
 
     /// Append a line to a session's log (best-effort — a persistence failure is logged, never
     /// fatal to a running session). No-op for an in-memory store.
     fn append(&self, id: &str, line: &LogLine) {
-        let Some(dir) = &self.dir else { return };
-        let path = dir.join(format!("{}.jsonl", sanitize_id(id)));
-        let mut serialized = match serde_json::to_string(line) {
-            Ok(s) => s,
-            Err(e) => {
-                warn!(error = %e, "goal-session store: serialize failed");
-                return;
-            }
-        };
-        serialized.push('\n');
-        use std::io::Write;
-        let write = std::fs::OpenOptions::new()
-            .create(true)
-            .append(true)
-            .open(&path)
-            .and_then(|mut f| f.write_all(serialized.as_bytes()));
-        if let Err(e) = write {
-            warn!(error = %e, path = %path.display(), "goal-session store: append failed");
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn insert(&self, record: GoalSessionRecord) {
         let id = record.id.clone();
         self.append(
             &id,
             &LogLine::Start {
                 record: Box::new(record.clone()),

---- store::tests::awaiting_session_is_parked_on_rehydrate_not_failed stdout ----

thread 'store::tests::awaiting_session_is_parked_on_rehydrate_not_failed' (19808) panicked at crates\session\src\store.rs:516:44:
called `Option::unwrap()` on a `None` value

---- store::tests::mid_execution_session_is_coerced_to_failed_on_rehydrate stdout ----

thread 'store::tests::mid_execution_session_is_coerced_to_failed_on_rehydrate' (1260) panicked at crates\session\src\store.rs:546:45:
called `Option::unwrap()` on a `None` value

---- store::tests::durable_store_rehydrates_a_finished_session stdout ----

thread 'store::tests::durable_store_rehydrates_a_finished_session' (6556) panicked at crates\session\src\store.rs:481:44:
session should rehydrate

failures:
    store::tests::awaiting_session_is_parked_on_rehydrate_not_failed
    store::tests::durable_store_rehydrates_a_finished_session
    store::tests::mid_execution_session_is_coerced_to_failed_on_rehydrate

test result: FAILED. 13 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
