*** crates/session/src/store.rs:177:9: replace GoalSessionStore::get -> Option<GoalSessionRecord> with None

*** mutation diff:
--- crates/session/src/store.rs
+++ replace GoalSessionStore::get -> Option<GoalSessionRecord> with None
@@ -169,17 +169,17 @@
                 events: Vec::new(),
                 turns: Vec::new(),
                 bus,
             },
         );
     }
 
     pub async fn get(&self, id: &str) -> Option<GoalSessionRecord> {
-        self.inner.lock().await.get(id).map(|s| s.record.clone())
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn list(&self) -> Vec<GoalSessionRecord> {
         let mut rows: Vec<_> = self
             .inner
             .lock()
             .await
             .values()

---- life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted stdout ----

thread 'life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted' (26244) panicked at crates\session\src\life_demo.rs:537:9:
assertion `left == right` failed
  left: Unknown
 right: NotPermitted

---- life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript stdout ----

thread 'life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript' (11812) panicked at crates\session\src\life_demo.rs:852:14:
a resumable parked session must accept its answer: Unknown

---- life_demo::tests::a_parked_session_is_not_told_it_finished stdout ----

thread 'life_demo::tests::a_parked_session_is_not_told_it_finished' (13036) panicked at crates\session\src\life_demo.rs:754:9:
a parked session must report Parked, not Terminal: Unknown

failures:
    life_demo::tests::a_grant_is_never_widened_by_sending_input
    life_demo::tests::a_parked_session_is_not_told_it_finished
    life_demo::tests::a_session_that_may_ask_but_not_write_is_refused_at_the_write
    life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted
    life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript
    life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer
    life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted
    life_demo::tests::life_domain_session_succeeds_without_coding_pack
    life_demo::tests::send_input_to_finished_session_errors
    store::tests::awaiting_session_is_parked_on_rehydrate_not_failed
    store::tests::durable_store_rehydrates_a_finished_session
    store::tests::mid_execution_session_is_coerced_to_failed_on_rehydrate

test result: FAILED. 4 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
