*** crates/session/src/store.rs:181:9: replace GoalSessionStore::list -> Vec<GoalSessionRecord> with vec![]

*** mutation diff:
--- crates/session/src/store.rs
+++ replace GoalSessionStore::list -> Vec<GoalSessionRecord> with vec![]
@@ -173,25 +173,17 @@
         );
     }
 
     pub async fn get(&self, id: &str) -> Option<GoalSessionRecord> {
         self.inner.lock().await.get(id).map(|s| s.record.clone())
     }
 
     pub async fn list(&self) -> Vec<GoalSessionRecord> {
-        let mut rows: Vec<_> = self
-            .inner
-            .lock()
-            .await
-            .values()
-            .map(|s| s.record.clone())
-            .collect();
-        rows.sort_by(|a, b| b.created_at.cmp(&a.created_at));
-        rows
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn events(&self, id: &str) -> Option<Vec<SessionEvent>> {
         self.inner.lock().await.get(id).map(|s| s.events.clone())
     }
 
     /// Subscribe to live events. Also returns a snapshot of events so far (for catch-up).
     pub async fn subscribe(

*** result: Success
