*** crates/session/src/store.rs:193:9: replace GoalSessionStore::events -> Option<Vec<SessionEvent>> with None

*** mutation diff:
--- crates/session/src/store.rs
+++ replace GoalSessionStore::events -> Option<Vec<SessionEvent>> with None
@@ -185,17 +185,17 @@
             .values()
             .map(|s| s.record.clone())
             .collect();
         rows.sort_by(|a, b| b.created_at.cmp(&a.created_at));
         rows
     }
 
     pub async fn events(&self, id: &str) -> Option<Vec<SessionEvent>> {
-        self.inner.lock().await.get(id).map(|s| s.events.clone())
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Subscribe to live events. Also returns a snapshot of events so far (for catch-up).
     pub async fn subscribe(
         &self,
         id: &str,
     ) -> Option<(Vec<SessionEvent>, broadcast::Receiver<SessionEvent>)> {
         let map = self.inner.lock().await;

---- store::tests::in_memory_store_persists_nothing stdout ----

thread 'store::tests::in_memory_store_persists_nothing' (23232) panicked at crates\session\src\store.rs:588:45:
called `Option::unwrap()` on a `None` value

---- store::tests::durable_store_rehydrates_a_finished_session stdout ----

thread 'store::tests::durable_store_rehydrates_a_finished_session' (6848) panicked at crates\session\src\store.rs:503:50:
called `Option::unwrap()` on a `None` value

---- life_demo::tests::life_domain_session_succeeds_without_coding_pack stdout ----

thread 'life_demo::tests::life_domain_session_succeeds_without_coding_pack' (26492) panicked at crates\session\src\life_demo.rs:684:17:
assertion failed: !snap.events.is_empty()

failures:
    life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer
    life_demo::tests::life_domain_session_succeeds_without_coding_pack
    store::tests::durable_store_rehydrates_a_finished_session
    store::tests::in_memory_store_persists_nothing

test result: FAILED. 12 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.56s

*** result: Failure(101)
