*** crates/session/src/store.rs:208:9: replace GoalSessionStore::turns -> Vec<(TurnAuthor, String)> with vec![]

*** mutation diff:
--- crates/session/src/store.rs
+++ replace GoalSessionStore::turns -> Vec<(TurnAuthor, String)> with vec![]
@@ -200,22 +200,17 @@
     ) -> Option<(Vec<SessionEvent>, broadcast::Receiver<SessionEvent>)> {
         let map = self.inner.lock().await;
         let s = map.get(id)?;
         Some((s.events.clone(), s.bus.subscribe()))
     }
 
     /// The turns recorded for `id`, in order — what a pack (or the hub) said and was told.
     pub async fn turns(&self, id: &str) -> Vec<(TurnAuthor, String)> {
-        self.inner
-            .lock()
-            .await
-            .get(id)
-            .map(|s| s.turns.clone())
-            .unwrap_or_default()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn append_turn(&self, session_id: &str, author: TurnAuthor, content: String) {
         if let Some(s) = self.inner.lock().await.get_mut(session_id) {
             s.turns.push((author, content));
         }
     }

---- life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript stdout ----

thread 'life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript' (20560) panicked at crates\session\src\life_demo.rs:861:9:
the pack must remember the question it asked: []

failures:
    life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
