*** crates/session/src/store.rs:217:9: replace GoalSessionStore::append_turn with ()

*** mutation diff:
--- crates/session/src/store.rs
+++ replace GoalSessionStore::append_turn with ()
@@ -209,19 +209,17 @@
             .lock()
             .await
             .get(id)
             .map(|s| s.turns.clone())
             .unwrap_or_default()
     }
 
     pub async fn append_turn(&self, session_id: &str, author: TurnAuthor, content: String) {
-        if let Some(s) = self.inner.lock().await.get_mut(session_id) {
-            s.turns.push((author, content));
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn push_event(&self, event: SessionEvent) {
         let persist = {
             let mut map = self.inner.lock().await;
             if let Some(s) = map.get_mut(&event.session_id) {
                 match &event.kind {
                     SessionEventKind::AwaitingInput { .. } => s.record.awaiting_input = true,

---- life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript stdout ----

thread 'life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript' (25616) panicked at crates\session\src\life_demo.rs:861:9:
the pack must remember the question it asked: []

failures:
    life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
