*** crates/session/src/store.rs:223:9: replace GoalSessionStore::push_event with ()

*** mutation diff:
--- crates/session/src/store.rs
+++ replace GoalSessionStore::push_event with ()
@@ -215,36 +215,17 @@
 
     pub async fn append_turn(&self, session_id: &str, author: TurnAuthor, content: String) {
         if let Some(s) = self.inner.lock().await.get_mut(session_id) {
             s.turns.push((author, content));
         }
     }
 
     pub async fn push_event(&self, event: SessionEvent) {
-        let persist = {
-            let mut map = self.inner.lock().await;
-            if let Some(s) = map.get_mut(&event.session_id) {
-                match &event.kind {
-                    SessionEventKind::AwaitingInput { .. } => s.record.awaiting_input = true,
-                    SessionEventKind::HumanInput { .. } => s.record.awaiting_input = false,
-                    _ => {}
-                }
-                s.events.push(event.clone());
-                s.record.event_count = s.events.len();
-                let _ = s.bus.send(event.clone());
-                true
-            } else {
-                false
-            }
-        };
-        if persist {
-            let id = event.session_id.clone();
-            self.append(&id, &LogLine::Event { event });
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn set_status(&self, id: &str, status: SessionStatus) {
         let finished_at = {
             let mut map = self.inner.lock().await;
             match map.get_mut(id) {
                 Some(s) => {
                     s.record.status = status;

---- store::tests::in_memory_store_persists_nothing stdout ----

thread 'store::tests::in_memory_store_persists_nothing' (4052) panicked at crates\session\src\store.rs:569:9:
assertion `left == right` failed
  left: 0
 right: 1

---- store::tests::durable_store_rehydrates_a_finished_session stdout ----

thread 'store::tests::durable_store_rehydrates_a_finished_session' (23828) panicked at crates\session\src\store.rs:485:9:
assertion `left == right` failed
  left: 0
 right: 2

---- store::tests::awaiting_session_is_parked_on_rehydrate_not_failed stdout ----

thread 'store::tests::awaiting_session_is_parked_on_rehydrate_not_failed' (16784) panicked at crates\session\src\store.rs:516:9:
assertion `left == right` failed
  left: Failed
 right: Parked

failures:
    life_demo::tests::a_grant_is_never_widened_by_sending_input
    life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer
    life_demo::tests::life_domain_session_succeeds_without_coding_pack
    store::tests::awaiting_session_is_parked_on_rehydrate_not_failed
    store::tests::durable_store_rehydrates_a_finished_session
    store::tests::in_memory_store_persists_nothing

test result: FAILED. 10 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.57s

*** result: Failure(101)
