*** crates/session/src/store.rs:227:21: delete match arm SessionEventKind::AwaitingInput{..} in GoalSessionStore::push_event

*** mutation diff:
--- crates/session/src/store.rs
+++ delete match arm SessionEventKind::AwaitingInput{..} in GoalSessionStore::push_event
@@ -219,17 +219,17 @@
         }
     }
 
     pub async fn push_event(&self, event: SessionEvent) {
         let persist = {
             let mut map = self.inner.lock().await;
             if let Some(s) = map.get_mut(&event.session_id) {
                 match &event.kind {
-                    SessionEventKind::AwaitingInput { .. } => s.record.awaiting_input = true,
+                     /* ~ changed by cargo-mutants ~ */
                     SessionEventKind::HumanInput { .. } => s.record.awaiting_input = false,
                     _ => {}
                 }
                 s.events.push(event.clone());
                 s.record.event_count = s.events.len();
                 let _ = s.bus.send(event.clone());
                 true
             } else {

---- life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer stdout ----

thread 'life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer' (7776) panicked at crates\session\src\life_demo.rs:422:9:
pack never reached AwaitingInput

---- life_demo::tests::a_grant_is_never_widened_by_sending_input stdout ----

thread 'life_demo::tests::a_grant_is_never_widened_by_sending_input' (24464) panicked at crates\session\src\life_demo.rs:636:29:
session never awaited input

failures:
    life_demo::tests::a_grant_is_never_widened_by_sending_input
    life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer

test result: FAILED. 14 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.58s

*** result: Failure(101)
