*** crates/session/src/store.rs:246:9: replace GoalSessionStore::set_status with ()

*** mutation diff:
--- crates/session/src/store.rs
+++ replace GoalSessionStore::set_status with ()
@@ -238,38 +238,17 @@
         };
         if persist {
             let id = event.session_id.clone();
             self.append(&id, &LogLine::Event { event });
         }
     }
 
     pub async fn set_status(&self, id: &str, status: SessionStatus) {
-        let finished_at = {
-            let mut map = self.inner.lock().await;
-            match map.get_mut(id) {
-                Some(s) => {
-                    s.record.status = status;
-                    if status.is_terminal() {
-                        s.record.finished_at = Some(Utc::now());
-                    }
-                    Some(s.record.finished_at)
-                }
-                None => None,
-            }
-        };
-        if let Some(finished_at) = finished_at {
-            self.append(
-                id,
-                &LogLine::Status {
-                    status,
-                    finished_at,
-                },
-            );
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub async fn finish(&self, id: &str, status: SessionStatus, result: GoalResult) {
         let finished_at = {
             let mut map = self.inner.lock().await;
             match map.get_mut(id) {
                 Some(s) => {
                     let finished_at = Utc::now();

*** result: Success
