*** crates/session/src/store.rs:271:9: replace GoalSessionStore::finish with ()

*** mutation diff:
--- crates/session/src/store.rs
+++ replace GoalSessionStore::finish with ()
@@ -263,42 +263,17 @@
                     status,
                     finished_at,
                 },
             );
         }
     }
 
     pub async fn finish(&self, id: &str, status: SessionStatus, result: GoalResult) {
-        let finished_at = {
-            let mut map = self.inner.lock().await;
-            match map.get_mut(id) {
-                Some(s) => {
-                    let finished_at = Utc::now();
-                    s.record.status = status;
-                    s.record.result = Some(result.clone());
-                    s.record.finished_at = Some(finished_at);
-                    // A terminal session cannot be awaiting input, even if it died mid-prompt
-                    // (e.g. idle-budget BudgetExhausted after an AwaitingInput with no answer).
-                    s.record.awaiting_input = false;
-                    Some(finished_at)
-                }
-                None => None,
-            }
-        };
-        if let Some(finished_at) = finished_at {
-            self.append(
-                id,
-                &LogLine::Finish {
-                    status,
-                    result,
-                    finished_at,
-                },
-            );
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Replay one session log into a [`SessionInner`], applying lines in order. Returns `None` if the
 /// file has no `start` line (nothing to anchor a record on).
 fn replay_file(path: &Path) -> Option<SessionInner> {
     let content = std::fs::read_to_string(path).ok()?;
     let mut record: Option<GoalSessionRecord> = None;

---- store::tests::durable_store_rehydrates_a_finished_session stdout ----

thread 'store::tests::durable_store_rehydrates_a_finished_session' (21020) panicked at crates\session\src\store.rs:475:9:
assertion `left == right` failed
  left: Failed
 right: Succeeded

---- life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted stdout ----

thread 'life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted' (5200) panicked at crates\session\src\life_demo.rs:380:9:
session 01KXGDVP6G3H7BXRY125M1HNZ2 did not finish

---- life_demo::tests::send_input_to_finished_session_errors stdout ----

thread 'life_demo::tests::send_input_to_finished_session_errors' (14148) panicked at crates\session\src\life_demo.rs:380:9:
session 01KXGDVP6GZ1SETMWVT3SB4CG4 did not finish

failures:
    life_demo::tests::a_grant_is_never_widened_by_sending_input
    life_demo::tests::a_session_that_may_ask_but_not_write_is_refused_at_the_write
    life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript
    life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer
    life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted
    life_demo::tests::life_domain_session_succeeds_without_coding_pack
    life_demo::tests::send_input_to_finished_session_errors
    store::tests::durable_store_rehydrates_a_finished_session

test result: FAILED. 8 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.57s

*** result: Failure(101)
