*** crates/session/src/store.rs:303:5: replace replay_file -> Option<SessionInner> with None

*** mutation diff:
--- crates/session/src/store.rs
+++ replace replay_file -> Option<SessionInner> with None
@@ -295,94 +295,17 @@
             );
         }
     }
 }
 
 /// Replay one session log into a [`SessionInner`], applying lines in order. Returns `None` if the
 /// file has no `start` line (nothing to anchor a record on).
 fn replay_file(path: &Path) -> Option<SessionInner> {
-    let content = std::fs::read_to_string(path).ok()?;
-    let mut record: Option<GoalSessionRecord> = None;
-    let mut events: Vec<SessionEvent> = Vec::new();
-
-    for line in content.lines() {
-        if line.trim().is_empty() {
-            continue;
-        }
-        let Ok(entry) = serde_json::from_str::<LogLine>(line) else {
-            continue; // tolerate a torn last line / unknown future line
-        };
-        match entry {
-            LogLine::Start { record: r } => record = Some(*r),
-            LogLine::Event { event } => {
-                if let Some(rec) = record.as_mut() {
-                    match &event.kind {
-                        SessionEventKind::AwaitingInput { .. } => rec.awaiting_input = true,
-                        SessionEventKind::HumanInput { .. } => rec.awaiting_input = false,
-                        _ => {}
-                    }
-                }
-                events.push(event);
-            }
-            LogLine::Status {
-                status,
-                finished_at,
-            } => {
-                if let Some(rec) = record.as_mut() {
-                    rec.status = status;
-                    rec.finished_at = finished_at;
-                }
-            }
-            LogLine::Finish {
-                status,
-                result,
-                finished_at,
-            } => {
-                if let Some(rec) = record.as_mut() {
-                    rec.status = status;
-                    rec.result = Some(result);
-                    rec.finished_at = Some(finished_at);
-                    rec.awaiting_input = false;
-                }
-            }
-        }
-    }
-
-    let mut record = record?;
-    record.event_count = events.len();
-
-    // A session that was still running when the daemon stopped can't be resumed — mark it Failed so
-    // surfaces show it as terminal (its transcript stays fully viewable on rejoin). E6 exception:
-    // an awaiting session is only *parked*, not failed.
-    if !record.status.is_terminal() {
-        if record.awaiting_input {
-            record.status = SessionStatus::Parked;
-        } else {
-            record.status = SessionStatus::Failed;
-            record.awaiting_input = false;
-            if record.result.is_none() {
-                record.result = Some(GoalResult {
-                    terminal: TerminalKind::Failed,
-                    summary: "interrupted by daemon restart (not resumable)".into(),
-                    artifacts: vec![],
-                    diagnostics: serde_json::json!({ "interrupted": true }),
-                });
-            }
-        }
-    }
-
-    let (bus, _) = broadcast::channel(EVENT_CHANNEL_CAPACITY);
-    Some(SessionInner {
-        record,
-        events,
-        // This double does not persist turns — the production store does, as message-DAG nodes.
-        turns: Vec::new(),
-        bus,
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Make a session id safe as a filename (ULIDs already are; a client-supplied id might not be).
 fn sanitize_id(id: &str) -> String {
     id.chars()
         .map(|c| {
             if c.is_ascii_alphanumeric() || c == '-' || c == '_' {
                 c

---- store::tests::awaiting_session_is_parked_on_rehydrate_not_failed stdout ----

thread 'store::tests::awaiting_session_is_parked_on_rehydrate_not_failed' (25004) panicked at crates\session\src\store.rs:457:44:
called `Option::unwrap()` on a `None` value

---- store::tests::mid_execution_session_is_coerced_to_failed_on_rehydrate stdout ----

thread 'store::tests::mid_execution_session_is_coerced_to_failed_on_rehydrate' (22248) panicked at crates\session\src\store.rs:487:45:
called `Option::unwrap()` on a `None` value

---- store::tests::durable_store_rehydrates_a_finished_session stdout ----

thread 'store::tests::durable_store_rehydrates_a_finished_session' (2768) panicked at crates\session\src\store.rs:422:44:
session should rehydrate

failures:
    store::tests::awaiting_session_is_parked_on_rehydrate_not_failed
    store::tests::durable_store_rehydrates_a_finished_session
    store::tests::mid_execution_session_is_coerced_to_failed_on_rehydrate

test result: FAILED. 13 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
