*** crates/session/src/store.rs:319:25: delete match arm SessionEventKind::AwaitingInput{..} in replay_file

*** mutation diff:
--- crates/session/src/store.rs
+++ delete match arm SessionEventKind::AwaitingInput{..} in replay_file
@@ -311,17 +311,17 @@
         let Ok(entry) = serde_json::from_str::<LogLine>(line) else {
             continue; // tolerate a torn last line / unknown future line
         };
         match entry {
             LogLine::Start { record: r } => record = Some(*r),
             LogLine::Event { event } => {
                 if let Some(rec) = record.as_mut() {
                     match &event.kind {
-                        SessionEventKind::AwaitingInput { .. } => rec.awaiting_input = true,
+                         /* ~ changed by cargo-mutants ~ */
                         SessionEventKind::HumanInput { .. } => rec.awaiting_input = false,
                         _ => {}
                     }
                 }
                 events.push(event);
             }
             LogLine::Status {
                 status,

---- store::tests::awaiting_session_is_parked_on_rehydrate_not_failed stdout ----

thread 'store::tests::awaiting_session_is_parked_on_rehydrate_not_failed' (20012) panicked at crates\session\src\store.rs:535:9:
assertion `left == right` failed
  left: Failed
 right: Parked

failures:
    store::tests::awaiting_session_is_parked_on_rehydrate_not_failed

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
