*** crates/session/src/store.rs:356:8: delete ! in replay_file

*** mutation diff:
--- crates/session/src/store.rs
+++ delete ! in replay_file
@@ -348,17 +348,17 @@
     }
 
     let mut record = record?;
     record.event_count = events.len();
 
     // A session that was still running when the daemon stopped can't be resumed — mark it Failed so
     // surfaces show it as terminal (its transcript stays fully viewable on rejoin). E6 exception:
     // an awaiting session is only *parked*, not failed.
-    if !record.status.is_terminal() {
+    if  /* ~ changed by cargo-mutants ~ */record.status.is_terminal() {
         if record.awaiting_input {
             record.status = SessionStatus::Parked;
         } else {
             record.status = SessionStatus::Failed;
             record.awaiting_input = false;
             if record.result.is_none() {
                 record.result = Some(GoalResult {
                     terminal: TerminalKind::Failed,

---- store::tests::awaiting_session_is_parked_on_rehydrate_not_failed stdout ----

thread 'store::tests::awaiting_session_is_parked_on_rehydrate_not_failed' (11604) panicked at crates\session\src\store.rs:535:9:
assertion `left == right` failed
  left: Running
 right: Parked

---- store::tests::mid_execution_session_is_coerced_to_failed_on_rehydrate stdout ----

thread 'store::tests::mid_execution_session_is_coerced_to_failed_on_rehydrate' (25336) panicked at crates\session\src\store.rs:565:9:
assertion `left == right` failed
  left: Running
 right: Failed

---- store::tests::durable_store_rehydrates_a_finished_session stdout ----

thread 'store::tests::durable_store_rehydrates_a_finished_session' (2936) panicked at crates\session\src\store.rs:500:9:
assertion `left == right` failed
  left: Failed
 right: Succeeded

failures:
    store::tests::awaiting_session_is_parked_on_rehydrate_not_failed
    store::tests::durable_store_rehydrates_a_finished_session
    store::tests::mid_execution_session_is_coerced_to_failed_on_rehydrate

test result: FAILED. 13 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
