*** crates/session/src/store.rs:402:9: replace <impl crate::record_store::SessionRecordStore for GoalSessionStore>::insert with ()

*** mutation diff:
--- crates/session/src/store.rs
+++ replace <impl crate::record_store::SessionRecordStore for GoalSessionStore>::insert with ()
@@ -394,17 +394,17 @@
 }
 
 /// The kernel's view of this store (S5′). Delegates to the inherent methods above — keeping those
 /// public means the concrete store stays directly usable (tests, tools) while the hub talks only to
 /// the trait, so a converged `Session` store can take its place without the hub noticing.
 #[async_trait::async_trait]
 impl crate::record_store::SessionRecordStore for GoalSessionStore {
     async fn insert(&self, record: GoalSessionRecord) {
-        GoalSessionStore::insert(self, record).await
+        () /* ~ changed by cargo-mutants ~ */
     }
     async fn get(&self, id: &str) -> Option<GoalSessionRecord> {
         GoalSessionStore::get(self, id).await
     }
     async fn list(&self) -> Vec<GoalSessionRecord> {
         GoalSessionStore::list(self).await
     }
     async fn events(&self, id: &str) -> Option<Vec<SessionEvent>> {

---- life_demo::tests::a_parked_session_is_not_told_it_finished stdout ----

thread 'life_demo::tests::a_parked_session_is_not_told_it_finished' (948) panicked at crates\session\src\life_demo.rs:754:9:
a parked session must report Parked, not Terminal: Unknown

---- life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript stdout ----

thread 'life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript' (18496) panicked at crates\session\src\life_demo.rs:852:14:
a resumable parked session must accept its answer: Unknown

---- life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted stdout ----

thread 'life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted' (3768) panicked at crates\session\src\life_demo.rs:537:9:
assertion `left == right` failed
  left: Unknown
 right: NotPermitted

failures:
    life_demo::tests::a_grant_is_never_widened_by_sending_input
    life_demo::tests::a_parked_session_is_not_told_it_finished
    life_demo::tests::a_session_that_may_ask_but_not_write_is_refused_at_the_write
    life_demo::tests::a_session_without_ask_human_refuses_input_as_not_permitted
    life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript
    life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer
    life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted
    life_demo::tests::life_domain_session_succeeds_without_coding_pack
    life_demo::tests::send_input_to_finished_session_errors

test result: FAILED. 7 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
