*** crates/session/src/store.rs:411:9: replace <impl crate::record_store::SessionRecordStore for GoalSessionStore>::events -> Option<Vec<SessionEvent>> with None

*** mutation diff:
--- crates/session/src/store.rs
+++ replace <impl crate::record_store::SessionRecordStore for GoalSessionStore>::events -> Option<Vec<SessionEvent>> with None
@@ -403,17 +403,17 @@
     }
     async fn get(&self, id: &str) -> Option<GoalSessionRecord> {
         GoalSessionStore::get(self, id).await
     }
     async fn list(&self) -> Vec<GoalSessionRecord> {
         GoalSessionStore::list(self).await
     }
     async fn events(&self, id: &str) -> Option<Vec<SessionEvent>> {
-        GoalSessionStore::events(self, id).await
+        None /* ~ changed by cargo-mutants ~ */
     }
     async fn subscribe(
         &self,
         id: &str,
     ) -> Option<(Vec<SessionEvent>, broadcast::Receiver<SessionEvent>)> {
         GoalSessionStore::subscribe(self, id).await
     }
     async fn push_event(&self, event: SessionEvent) {

---- life_demo::tests::life_domain_session_succeeds_without_coding_pack stdout ----

thread 'life_demo::tests::life_domain_session_succeeds_without_coding_pack' (20352) panicked at crates\session\src\life_demo.rs:684:17:
assertion failed: !snap.events.is_empty()

---- life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer stdout ----

thread 'life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer' (11460) panicked at crates\session\src\life_demo.rs:422:9:
pack never reached AwaitingInput

failures:
    life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer
    life_demo::tests::life_domain_session_succeeds_without_coding_pack

test result: FAILED. 14 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.55s

*** result: Failure(101)
