*** crates/session/src/store.rs:417:9: replace <impl crate::record_store::SessionRecordStore for GoalSessionStore>::subscribe -> Option<(Vec<SessionEvent>, broadcast::Receiver<SessionEvent>)> with None

*** mutation diff:
--- crates/session/src/store.rs
+++ replace <impl crate::record_store::SessionRecordStore for GoalSessionStore>::subscribe -> Option<(Vec<SessionEvent>, broadcast::Receiver<SessionEvent>)> with None
@@ -409,17 +409,17 @@
     }
     async fn events(&self, id: &str) -> Option<Vec<SessionEvent>> {
         GoalSessionStore::events(self, id).await
     }
     async fn subscribe(
         &self,
         id: &str,
     ) -> Option<(Vec<SessionEvent>, broadcast::Receiver<SessionEvent>)> {
-        GoalSessionStore::subscribe(self, id).await
+        None /* ~ changed by cargo-mutants ~ */
     }
     async fn push_event(&self, event: SessionEvent) {
         GoalSessionStore::push_event(self, event).await
     }
     async fn live_subscriber_count(&self, id: &str) -> usize {
         let map = self.inner.lock().await;
         map.get(id).map(|s| s.bus.receiver_count()).unwrap_or(0)
     }

*** result: Success
