*** crates/session/src/store.rs:420:9: replace <impl crate::record_store::SessionRecordStore for GoalSessionStore>::push_event with ()

*** mutation diff:
--- crates/session/src/store.rs
+++ replace <impl crate::record_store::SessionRecordStore for GoalSessionStore>::push_event with ()
@@ -412,17 +412,17 @@
     }
     async fn subscribe(
         &self,
         id: &str,
     ) -> Option<(Vec<SessionEvent>, broadcast::Receiver<SessionEvent>)> {
         GoalSessionStore::subscribe(self, id).await
     }
     async fn push_event(&self, event: SessionEvent) {
-        GoalSessionStore::push_event(self, event).await
+        () /* ~ changed by cargo-mutants ~ */
     }
     async fn live_subscriber_count(&self, id: &str) -> usize {
         let map = self.inner.lock().await;
         map.get(id).map(|s| s.bus.receiver_count()).unwrap_or(0)
     }
     async fn append_turn(&self, session_id: &str, author: TurnAuthor, content: String) {
         GoalSessionStore::append_turn(self, session_id, author, content).await
     }

---- life_demo::tests::life_domain_session_succeeds_without_coding_pack stdout ----

thread 'life_demo::tests::life_domain_session_succeeds_without_coding_pack' (24280) panicked at crates\session\src\life_demo.rs:684:17:
assertion failed: !snap.events.is_empty()

---- life_demo::tests::a_grant_is_never_widened_by_sending_input stdout ----

thread 'life_demo::tests::a_grant_is_never_widened_by_sending_input' (20052) panicked at crates\session\src\life_demo.rs:636:29:
session never awaited input

---- life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer stdout ----

thread 'life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer' (12160) panicked at crates\session\src\life_demo.rs:422:9:
pack never reached AwaitingInput

failures:
    life_demo::tests::a_grant_is_never_widened_by_sending_input
    life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer
    life_demo::tests::life_domain_session_succeeds_without_coding_pack

test result: FAILED. 13 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.58s

*** result: Failure(101)
