*** crates/session/src/store.rs:423:9: replace <impl crate::record_store::SessionRecordStore for GoalSessionStore>::live_subscriber_count -> usize with 1

*** mutation diff:
--- crates/session/src/store.rs
+++ replace <impl crate::record_store::SessionRecordStore for GoalSessionStore>::live_subscriber_count -> usize with 1
@@ -415,18 +415,17 @@
         id: &str,
     ) -> Option<(Vec<SessionEvent>, broadcast::Receiver<SessionEvent>)> {
         GoalSessionStore::subscribe(self, id).await
     }
     async fn push_event(&self, event: SessionEvent) {
         GoalSessionStore::push_event(self, event).await
     }
     async fn live_subscriber_count(&self, id: &str) -> usize {
-        let map = self.inner.lock().await;
-        map.get(id).map(|s| s.bus.receiver_count()).unwrap_or(0)
+        1 /* ~ changed by cargo-mutants ~ */
     }
     async fn append_turn(&self, session_id: &str, author: TurnAuthor, content: String) {
         GoalSessionStore::append_turn(self, session_id, author, content).await
     }
     async fn turns(&self, session_id: &str) -> Vec<(TurnAuthor, String)> {
         GoalSessionStore::turns(self, session_id).await
     }
     async fn set_status(&self, id: &str, status: SessionStatus) {

*** result: Success
