*** crates/session/src/store.rs:427:9: replace <impl crate::record_store::SessionRecordStore for GoalSessionStore>::append_turn with ()

*** mutation diff:
--- crates/session/src/store.rs
+++ replace <impl crate::record_store::SessionRecordStore for GoalSessionStore>::append_turn with ()
@@ -419,17 +419,17 @@
     async fn push_event(&self, event: SessionEvent) {
         GoalSessionStore::push_event(self, event).await
     }
     async fn live_subscriber_count(&self, id: &str) -> usize {
         let map = self.inner.lock().await;
         map.get(id).map(|s| s.bus.receiver_count()).unwrap_or(0)
     }
     async fn append_turn(&self, session_id: &str, author: TurnAuthor, content: String) {
-        GoalSessionStore::append_turn(self, session_id, author, content).await
+        () /* ~ changed by cargo-mutants ~ */
     }
     async fn turns(&self, session_id: &str) -> Vec<(TurnAuthor, String)> {
         GoalSessionStore::turns(self, session_id).await
     }
     async fn set_status(&self, id: &str, status: SessionStatus) {
         GoalSessionStore::set_status(self, id, status).await
     }
     async fn finish(&self, id: &str, status: SessionStatus, result: GoalResult) {

---- life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript stdout ----

thread 'life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript' (4656) panicked at crates\session\src\life_demo.rs:861:9:
the pack must remember the question it asked: []

failures:
    life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
