*** crates/session/src/store.rs:430:9: replace <impl crate::record_store::SessionRecordStore for GoalSessionStore>::turns -> Vec<(TurnAuthor, String)> with vec![]

*** mutation diff:
--- crates/session/src/store.rs
+++ replace <impl crate::record_store::SessionRecordStore for GoalSessionStore>::turns -> Vec<(TurnAuthor, String)> with vec![]
@@ -422,17 +422,17 @@
     async fn live_subscriber_count(&self, id: &str) -> usize {
         let map = self.inner.lock().await;
         map.get(id).map(|s| s.bus.receiver_count()).unwrap_or(0)
     }
     async fn append_turn(&self, session_id: &str, author: TurnAuthor, content: String) {
         GoalSessionStore::append_turn(self, session_id, author, content).await
     }
     async fn turns(&self, session_id: &str) -> Vec<(TurnAuthor, String)> {
-        GoalSessionStore::turns(self, session_id).await
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
     async fn set_status(&self, id: &str, status: SessionStatus) {
         GoalSessionStore::set_status(self, id, status).await
     }
     async fn finish(&self, id: &str, status: SessionStatus, result: GoalResult) {
         GoalSessionStore::finish(self, id, status, result).await
     }
 }

---- life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript stdout ----

thread 'life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript' (18424) panicked at crates\session\src\life_demo.rs:861:9:
the pack must remember the question it asked: []

failures:
    life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
