*** crates/session/src/store.rs:433:9: replace <impl crate::record_store::SessionRecordStore for GoalSessionStore>::set_status with ()

*** mutation diff:
--- crates/session/src/store.rs
+++ replace <impl crate::record_store::SessionRecordStore for GoalSessionStore>::set_status with ()
@@ -425,17 +425,17 @@
     }
     async fn append_turn(&self, session_id: &str, author: TurnAuthor, content: String) {
         GoalSessionStore::append_turn(self, session_id, author, content).await
     }
     async fn turns(&self, session_id: &str) -> Vec<(TurnAuthor, String)> {
         GoalSessionStore::turns(self, session_id).await
     }
     async fn set_status(&self, id: &str, status: SessionStatus) {
-        GoalSessionStore::set_status(self, id, status).await
+        () /* ~ changed by cargo-mutants ~ */
     }
     async fn finish(&self, id: &str, status: SessionStatus, result: GoalResult) {
         GoalSessionStore::finish(self, id, status, result).await
     }
 }
 
 #[cfg(test)]
 mod tests {

*** result: Success
