*** crates/session/src/store.rs:436:9: replace <impl crate::record_store::SessionRecordStore for GoalSessionStore>::finish with ()

*** mutation diff:
--- crates/session/src/store.rs
+++ replace <impl crate::record_store::SessionRecordStore for GoalSessionStore>::finish with ()
@@ -428,17 +428,17 @@
     }
     async fn turns(&self, session_id: &str) -> Vec<(TurnAuthor, String)> {
         GoalSessionStore::turns(self, session_id).await
     }
     async fn set_status(&self, id: &str, status: SessionStatus) {
         GoalSessionStore::set_status(self, id, status).await
     }
     async fn finish(&self, id: &str, status: SessionStatus, result: GoalResult) {
-        GoalSessionStore::finish(self, id, status, result).await
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::goal::{DomainHint, GoalSpec};

---- life_demo::tests::send_input_to_finished_session_errors stdout ----

thread 'life_demo::tests::send_input_to_finished_session_errors' (24100) panicked at crates\session\src\life_demo.rs:380:9:
session 01KXGDXGB4M9A1RDD007PBKZ04 did not finish

---- life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript stdout ----

thread 'life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript' (22140) panicked at crates\session\src\life_demo.rs:380:9:
session parked-2 did not finish

---- life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted stdout ----

thread 'life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted' (10280) panicked at crates\session\src\life_demo.rs:380:9:
session 01KXGDXGB4AWYFQFG6F4F2XKWR did not finish

failures:
    life_demo::tests::a_grant_is_never_widened_by_sending_input
    life_demo::tests::a_session_that_may_ask_but_not_write_is_refused_at_the_write
    life_demo::tests::answering_a_parked_session_resumes_the_pack_with_its_transcript
    life_demo::tests::interactive_session_asks_awaits_and_echoes_the_answer
    life_demo::tests::interactive_session_idle_budget_terminates_budget_exhausted
    life_demo::tests::life_domain_session_succeeds_without_coding_pack
    life_demo::tests::send_input_to_finished_session_errors

test result: FAILED. 9 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.58s

*** result: Failure(101)
